
Функция НайтиДоговора(Контрагент, Номер, Дата) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ Ссылка КАК Договор ИЗ Справочник.Договоры КАК Договоры ГДЕ Договоры.Владелец = &Контрагент И Договоры.Номер = &Номер И Договоры.Дата = &Дата");
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Номер", Номер);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Договор;
	КонецЕсли;
КонецФункции