
Процедура ПередЗаписью(Отказ)
	Если ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Номер) И ЗначениеЗаполнено(Дата) И ПометкаУдаления = Ссылка.ПометкаУдаления Тогда
		// Проверка на уникальность
		Если Константы.КонтрольУникальностиДоговоров.Получить() Тогда
			ДубликатСсылка = НайтиДубликата(ЭтотОбъект);
			Если ЗначениеЗаполнено(ДубликатСсылка) Тогда
				Если ДубликатСсылка.Владелец = Владелец Тогда
					Сообщить("Договор " + НРег(ВидДоговора) + " по номеру '" + Номер + "' уже принадлежит контрагенту '" + ДубликатСсылка.Владелец.Наименование + "' (Код: " + ДубликатСсылка.Владелец.Код + ")!");
					Отказ = Истина;
				КонецЕсли;
				
				Сообщить("Договор " + НРег(ВидДоговора) + " по номеру '" + Номер + "' принадлежит контрагенту '" + ДубликатСсылка.Владелец.Наименование + "' (Код: " + ДубликатСсылка.Владелец.Код + "), необходимо это исправить!");
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Номер = СокрЛП(Номер);
		Наименование = "№ " + Номер + " от " + Формат(Дата, "ДФ=dd.MM.yyyy");
	КонецЕсли;
КонецПроцедуры

Функция НайтиДубликата(Договор) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Договоры.Ссылка КАК Ссылка,
	|	Договоры.Номер КАК Номер,
	|	Договоры.Дата КАК Дата
	|ИЗ
	|	Справочник.Договоры КАК Договоры
	|ГДЕ ИСТИНА
	|	И Договоры.Номер = &Номер
	|	И Договоры.Ссылка <> &Ссылка
	|	И Договоры.ВидДоговора = &ВидДоговора
	|	И Договоры.Дата МЕЖДУ &Дата1 И &Дата2
	|СГРУППИРОВАТЬ ПО
	|	Договоры.Ссылка
	|");
	
	Запрос.УстановитьПараметр("Дата1", НачалоГода(Договор.Дата));
	Запрос.УстановитьПараметр("Дата2", КонецГода(Договор.Дата));
	Запрос.УстановитьПараметр("Номер", СокрЛП(Договор.Номер));
	Запрос.УстановитьПараметр("Ссылка", Договор.Ссылка);
	Запрос.УстановитьПараметр("Владелец", Договор.Владелец);
	Запрос.УстановитьПараметр("ВидДоговора", Договор.ВидДоговора);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Справочники.Договоры.ПустаяСсылка();
КонецФункции
