
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Для ИндексСтроки = 0 По Объект.Документы.Количество() - 1 Цикл
		Объект.Документы[ИндексСтроки].ЗначениеОтбора = ТекущийОбъект.Документы[ИндексСтроки].ХранилищеОтбора.Получить();
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Для ИндексСтроки = 0 По Объект.Документы.Количество() - 1 Цикл
		ТекущийОбъект.Документы[ИндексСтроки].ХранилищеОтбора = Новый ХранилищеЗначения(Объект.Документы[ИндексСтроки].ЗначениеОтбора);
	КонецЦикла;
КонецПроцедуры
