
Процедура СформироватьСчетФактуру(Данные) Экспорт
	ТабДок = Новый ТабличныйДокумент;
	
	Если ТипЗнч(Данные.Ссылка) = Тип("ДокументСсылка.РеализацияТМЦ") Тогда
		КоличествоКопий = ОбщийМодульСервер.ПолучитьЗначениеКонстанты("Реализация_КоличествоЭкземпляровВсего");
	Иначе
		КоличествоКопий = 1;
	КонецЕсли;
	
	Напечатать = ВвестиЧисло(КоличествоКопий, "Сколько копий напечатать?", 1, 0);
	
	ФактурыСервер.СформироватьСчетФактуру(Данные, ТабДок);	
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ПолеСверху = 2;
	ТабДок.ПолеСправа = 2;
	ТабДок.ПолеСнизу = 2;
	ТабДок.ПолеСлева = 2;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.КоличествоЭкземпляров = КоличествоКопий;
	
	Если Напечатать Тогда
		ТабДок.Напечатать(РежимИспользованияДиалогаПечати.НеИспользовать);
	Иначе
		ТабДок.Показать();
	КонецЕсли;
КонецПроцедуры

Процедура СформироватьСчетФактуруДляАгента(Данные) Экспорт
	ТабДок = Новый ТабличныйДокумент;
	
	Если ТипЗнч(Данные.Ссылка) = Тип("ДокументСсылка.РеализацияТМЦ") Тогда
		КоличествоКопий = ОбщийМодульСервер.ПолучитьЗначениеКонстанты("Реализация_КоличествоЭкземпляровВсего");
	Иначе
		КоличествоКопий = 1;
	КонецЕсли;
	
	Напечатать = ВвестиЧисло(КоличествоКопий, "Сколько копий напечатать?", 1, 0);
	
	ФактурыСервер.СформироватьСчетФактуруДляАгента(Данные, ТабДок);	
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ПолеСверху = 2;
	ТабДок.ПолеСправа = 2;
	ТабДок.ПолеСнизу = 2;
	ТабДок.ПолеСлева = 2;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДок.КоличествоЭкземпляров = КоличествоКопий;
	
	Если Напечатать Тогда
		ТабДок.Напечатать(РежимИспользованияДиалогаПечати.НеИспользовать);
	Иначе
		ТабДок.Показать();
	КонецЕсли;
КонецПроцедуры

Процедура СформироватьАктСверкиДляТары(ДокументОбъект) Экспорт
	ТабДок = Новый ТабличныйДокумент;
	
	ФактурыСервер.СформироватьАктСверкиДляТары(ДокументОбъект, ТабДок);
	
	КоличествоКопий = ОбщийМодульСервер.ПолучитьЗначениеКонстанты("Реализация_КоличествоЭкземпляровВсего");
	
	Если ВвестиЧисло(КоличествоКопий, "Сколько копий напечатать?", 1, 0) Тогда
		ТабДок.КоличествоЭкземпляров = КоличествоКопий;
		ТабДок.Напечатать(РежимИспользованияДиалогаПечати.НеИспользовать);
	Иначе
		ТабДок.КоличествоЭкземпляров = КоличествоКопий;
		ТабДок.Показать("Акт-сверки по таре #" + СокрЛП(ДокументОбъект.Номер));
	КонецЕсли;
КонецПроцедуры

Процедура СформироватьТТНПоТаре(ДокументОбъект) Экспорт
	ТабДок = Новый ТабличныйДокумент;
	
	ФактурыСервер.СформироватьТТНПоТаре(ДокументОбъект, ТабДок);
	
	ТабДок.Показать("ТТН по таре #" + ДокументОбъект.Номер);
КонецПроцедуры

Процедура СформироватьАктПППоТаре(ДокументОбъект) Экспорт
	ТабДок = Новый ТабличныйДокумент;
	
	ФактурыСервер.СформироватьАктПППоТаре(ДокументОбъект, ТабДок);
	
	ТабДок.Показать("Акт по таре #" + ДокументОбъект.Номер);
КонецПроцедуры

Процедура СформироватьПриемныйАкт(ДокументОбъект) Экспорт
	ТабДок = Новый ТабличныйДокумент;
	
	ФактурыСервер.СформироватьПриемныйАкт(ДокументОбъект, ТабДок);
	
	ТабДок.Показать("Приемный акт #" + ДокументОбъект.Номер);
КонецПроцедуры

Процедура СформироватьЭкспорт(ДокументСсылка)Экспорт
	ТабДок = Новый ТабличныйДокумент;
	
	ФактурыСервер.СформироватьЭкспорт(ДокументСсылка, ТабДок);
	
	ТабДок.Показать("Счет-фактура #" + СокрЛП(ОбщийМодульСервер.ПолучитьЗначениеРеквизита(ДокументСсылка, "Номер")));
КонецПроцедуры
