
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр СальдоПоМагазинам
	Движения.СальдоПоМагазинам.Записывать = Истина;
	
	Для Каждого Строка Из Обороты Цикл
		// регистр СальдоПоМагазинам Приход
		Если Строка.Сумма > 0 Тогда
			Движение = Движения.СальдоПоМагазинам.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Магазин = Строка.Магазин;
			Движение.Примечание = глНайтиПримечания(Строка.Комментарий);
			Движение.Сумма = Строка.Сумма;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Сумма = Обороты.Итог("Сумма");
КонецПроцедуры
