
&НаКлиенте
Функция ПолучитьСписокОператоров() Экспорт
	Операторы = Новый Структура;
	
	ЗарегистрироватьОператора(Операторы);
	
	Возврат Операторы;
КонецФункции

&НаКлиенте
Процедура ЗарегистрироватьОператора(Операторы)
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьМодульОператора(Оператор = Неопределено) Экспорт
	Если Оператор = Неопределено Тогда
		Оператор = ОбщийМодульСервер.ПолучитьЗначениеКонстанты("ЭДО_ОсновнойОператор");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Оператор) Тогда
		Возврат ПолучитьСписокОператоров()[Строка(Оператор)];
	Иначе
		ВызватьИсключение "E-imzo: Не удалось определить Оператора.";
	КонецЕсли;
КонецФункции

&НаКлиенте
Функция АвторизоватьОператора(Оператор = Неопределено) Экспорт
	МодульОператора = ПолучитьМодульОператора(Оператор);
	
	Если МодульОператора.ПроверитьАвторизацию() = Ложь Тогда
		Сокет = Вебсокет.ПолучитьСокет();
		
		EImzo.Верифицировать(Сокет);
		
		Сертификат = ПолучитьСертификатПользователя();
		
		СигнатураДокумента = МодульОператора.ПолучитьИдентификатор(Сертификат);
		
		ДанныеАвторизацииСертификата = EImzo.Авторизовать(Сокет, Сертификат, СигнатураДокумента);
		
		ШтампВремениОператора = МодульОператора.ПолучитьШтампВремени(ДанныеАвторизацииСертификата.Сигнатура);
		
		Подпись = EImzo.Подписать(Сокет, Сертификат, ДанныеАвторизацииСертификата.Подпись, ШтампВремениОператора);
		
		Инфо = EImzo.РаспарситьПсевдоним(ОбщийМодульСервер.ПолучитьЗначениеРеквизита(Сертификат, "Псевдоним"));
	
		МодульОператора.Авторизовать(Сертификат, Подпись, Инфо);
	КонецЕсли;
	
	Возврат МодульОператора;
КонецФункции

&НаКлиенте
Функция ПолучитьСертификатПользователя() Экспорт
	Сертификат = ОбщийМодульСервер.ПолучитьЗначениеРеквизита(ОбщийМодульСервер.ПолучитьПараметрыСеанса().Пользователь, "Сертификат");
	Если ЗначениеЗаполнено(Сертификат) Тогда
		Возврат Сертификат;
	Иначе
		ВызватьИсключение "E-imzo: Сертификат не выбран.";
	КонецЕсли;
КонецФункции

&НаКлиенте
Функция ПолучитьСтруктуруДокумента(Документ) Экспорт
	МодульОператора = АвторизоватьОператора();
	
	Возврат МодульОператора.ПолучитьСтруктуруДокумента(Документ);
КонецФункции

&НаКлиенте
Функция ПолучитьИнформациюПоКонтрагенту(Идентификатор) Экспорт
	МодульОператора = АвторизоватьОператора();
	
	Возврат МодульОператора.ПолучитьИнформациюПоКонтрагенту(Идентификатор);
КонецФункции

&НаКлиенте
Функция ПолучитьСписокКлассификаторов(Идентификатор) Экспорт
	МодульОператора = АвторизоватьОператора();
	
	Возврат МодульОператора.ПолучитьСписокКлассификаторов(Идентификатор);
КонецФункции

&НаКлиенте
Функция ПолучитьСписокДокументов(Настройки) Экспорт
	МодульОператора = АвторизоватьОператора();
	
	Возврат МодульОператора.ПолучитьСписокДокументов(Настройки);
КонецФункции

&НаКлиенте
Функция ПолучитьТелоДокумента(Идентификатор) Экспорт
	МодульОператора = АвторизоватьОператора();
	
	Возврат МодульОператора.ПолучитьТелоДокумента(Идентификатор);
КонецФункции

&НаКлиенте
Процедура ОтправитьДокумент(Документ, Подписать) Экспорт
	МодульОператора = АвторизоватьОператора();
	
	МодульОператора.ОтправитьДокумент(Документ, Подписать);
	
	Если Подписать Тогда
		ПодписатьДокумент(Документ);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодписатьДокумент(Документ) Экспорт
	МодульОператора = АвторизоватьОператора();
	
	Сертификат = ПолучитьСертификатПользователя();
	
	СтруктураДокумента = ПолучитьСтруктуруДокумента(Документ);
	
	СигнатураДокумента = СтроковыеФункции.ЗакодироватьBase64(СериализаторJSON.Сериализовать(СтруктураДокумента));
	
	
	Сокет = Вебсокет.ПолучитьСокет();
	
	EImzo.Верифицировать(Сокет);
	
	ДанныеАвторизацииСертификата = EImzo.Авторизовать(Сокет, Сертификат, СигнатураДокумента);
	
	ШтампВремениОператора = МодульОператора.ПолучитьШтампВремени(ДанныеАвторизацииСертификата.Сигнатура);
	
	Подпись = EImzo.Подписать(Сокет, Сертификат, ДанныеАвторизацииСертификата.Подпись, ШтампВремениОператора);
	
	МодульОператора.ПодписатьДокумент(Документ, СтруктураДокумента, Подпись);
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьДокумент(Документ) Экспорт
	МодульОператора = АвторизоватьОператора();
	
	МодульОператора.ПроверитьДокумент(Документ);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьДокумент(Документ) Экспорт
	МодульОператора = АвторизоватьОператора();
	
	Сертификат = ПолучитьСертификатПользователя();
	
	СтруктураДокумента = ПолучитьСтруктуруДокумента(Документ);
	
	СигнатураДокумента = СтроковыеФункции.ЗакодироватьBase64(СериализаторJSON.Сериализовать(СтруктураДокумента));
	
	
	Сокет = Вебсокет.ПолучитьСокет();
	
	EImzo.Верифицировать(Сокет);
	
	ДанныеАвторизацииСертификата = EImzo.Авторизовать(Сокет, Сертификат, СигнатураДокумента);
	
	ШтампВремениОператора = МодульОператора.ПолучитьШтампВремени(ДанныеАвторизацииСертификата.Сигнатура);
	
	Подпись = EImzo.Подписать(Сокет, Сертификат, ДанныеАвторизацииСертификата.Подпись, ШтампВремениОператора);
	
	МодульОператора.УдалитьДокумент(Документ, Подпись);
КонецПроцедуры
