
&После("Запустить")
Процедура ПереобработкаДокументов_Запустить() Экспорт
	Если ПользовательскиеЗадания.Статус("ПереобработкаДокументов") = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	КоличествоОшибок = 0;
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	Ссылка КАК Документ,
	|	Номер КАК НомерДокумента,
	|	Дата КАК ДатаДокумента
	|ИЗ
	|	Документ.АктСписанияТМЦ
	|ГДЕ
	|	Проведен = Истина
	|	И Дата МЕЖДУ &НачПериода И &КонПериода
	|
	|
	|ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ
	|	Ссылка КАК Документ,
	|	Номер КАК НомерДокумента,
	|	Дата КАК ДатаДокумента
	|ИЗ
	|	Документ.РеализацияТМЦ
	|ГДЕ
	|	Проведен = Истина
	|	И Дата МЕЖДУ &НачПериода И &КонПериода
	|
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаДокумента,
	|	НомерДокумента
	|");
	
	Запрос.УстановитьПараметр("НачПериода", НачалоДня(Константы.РегламентноеПерепроведение_НачалоПериода.Получить()));
	Запрос.УстановитьПараметр("КонПериода", КонецДня(Константы.РегламентноеПерепроведение_КонецПериода.Получить()));
	
	Если Константы.РегламентноеПерепроведение_ИспользоватьТранзакцию.Получить() Тогда
		НачатьТранзакцию();
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Попытка
			ДокументОбъект = Выборка.Документ.ПолучитьОбъект();
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ЗаписьЖурналаРегистрации("РегламентнаяПереобработкаДокументов", УровеньЖурналаРегистрации.Ошибка, Метаданные.Документы.РеализацияТМЦ, Выборка.Документ.Ссылка, ОписаниеОшибки());
			
			КоличествоОшибок = КоличествоОшибок + 1;
		КонецПопытки;
	КонецЦикла;
	
	Если Константы.РегламентноеПерепроведение_ИспользоватьТранзакцию.Получить() Тогда
		Если КоличествоОшибок = 0 Тогда
			ЗафиксироватьТранзакцию();
		Иначе
			ОтменитьТранзакцию();
		КонецЕсли;
	КонецЕсли;
	
	Если КоличествоОшибок > 0 Тогда
		ВызватьИсключение "Задание выполнено с ошибками. Количество ошибок: " + КоличествоОшибок;
	КонецЕсли;
КонецПроцедуры
