
&НаСервере
Процедура ОбновитьНаСервере()
	ОтветСервера = HTTP.Запрос("https://data.egov.uz/apiData/MainData/GetByFile?id=6113bd0fdb32b99538e08991&fileType=1&tableType=1&lang=1");
	СписокБанков = СериализаторJSON.Десериализовать(ОтветСервера);
	Для Каждого БанкЭлемент Из СписокБанков Цикл
		ВыборкаСсылка = Справочники.Банки.НайтиПоКоду(БанкЭлемент.Filialkodi);
		Если ЗначениеЗаполнено(ВыборкаСсылка) Тогда
			ВыборкаОбъект = ВыборкаСсылка.ПолучитьОбъект();
		Иначе
			ВыборкаОбъект = Справочники.Банки.СоздатьЭлемент();
		КонецЕсли;
		
		ВыборкаОбъект.Код = БанкЭлемент.Filialkodi;
		ВыборкаОбъект.Наименование = БанкЭлемент.Filialnomi;
		ВыборкаОбъект.ИНН = БанкЭлемент.STIRRAQAMI;
		ВыборкаОбъект.Адрес = БанкЭлемент.Filialmanzili;
		ВыборкаОбъект.Геолокация = БанкЭлемент.Geolokatsiya;
		ВыборкаОбъект.Записать();
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
	
	Элементы.Список.Обновить();
КонецПроцедуры
