
Процедура ПередЗаписью(Отказ)
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ДатаНачала > ДатаОкончания Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Неправильная дата начала.";
		Сообщение.Поле = "ДатаНачала";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		Отказ = Истина;
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Неправильная дата окончания.";
		Сообщение.Поле = "ДатаОкончания";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	
	//Если Активный Тогда
	//	Запрос = Новый Запрос("
	//		|ВЫБРАТЬ
	//		|	Скидки.Ссылка КАК Акция
	//		|ИЗ
	//		|	Справочник.Скидки КАК Скидки
	//		|ГДЕ
	//		|	Скидки.Ссылка <> &Ссылка
	//		|	И Скидки.Активный
	//		|	И (&ДатаНачала МЕЖДУ Скидки.ДатаНачала И Скидки.ДатаОкончания ИЛИ &ДатаОкончания МЕЖДУ Скидки.ДатаНачала И Скидки.ДатаОкончания)
	//		|	И Скидки.Каналы.Канал В (&Канал)
	//		|	И Скидки.Клиенты.Клиент В (&Клиент)
	//		|	И Скидки.Товары.Товар В ИЕРАРХИИ (&Товары)
	//		|"
	//	);
	//	
	//	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	//	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	//	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	//	Запрос.УстановитьПараметр("Канал", Каналы.ВыгрузитьКолонку("Канал"));
	//	Запрос.УстановитьПараметр("Клиент", Клиенты.ВыгрузитьКолонку("Клиент"));
	//	Запрос.УстановитьПараметр("Товары", Товары.ВыгрузитьКолонку("Товар"));
	//	
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	Если Выборка.Следующий() Тогда
	//		Сообщение = Новый СообщениеПользователю();
	//		Сообщение.Текст = "Неуникальная акция: существуют схожие акции в заданном интервале.";
	//		Сообщение.Поле = "";
	//		Сообщение.УстановитьДанные(ЭтотОбъект);
	//		Сообщение.Сообщить();
	//		Отказ = Истина;
	//	КонецЕсли;
	//КонецЕсли;
	
	Если Каналы.Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не заданы каналы.";
		Сообщение.Поле = "Каналы";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		Отказ = Истина;;
	КонецЕсли;
	
	Если Товары.Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не заданы скидки.";
		Сообщение.Поле = "Товары";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		Отказ = Истина;;
	КонецЕсли;
КонецПроцедуры
