
Функция СравнитьВерсии(Знач СтрокаВерсии1, Знач СтрокаВерсии2) Экспорт
	
	Строка1 = ?(ПустаяСтрока(СтрокаВерсии1), "0.0.0.0", СтрокаВерсии1);
	Строка2 = ?(ПустаяСтрока(СтрокаВерсии2), "0.0.0.0", СтрокаВерсии2);
	Версия1 = СтрРазделить(Строка1, ".");
	Если Версия1.Количество() <> 4 Тогда
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Неправильный формат параметра СтрокаВерсии1: %1'"), СтрокаВерсии1);
	КонецЕсли;
	Версия2 = СтрРазделить(Строка2, ".");
	Если Версия2.Количество() <> 4 Тогда
		ВызватьИсключение СтрШаблон(
	    	НСтр("ru = 'Неправильный формат параметра СтрокаВерсии2: %1'"), СтрокаВерсии2);
	КонецЕсли;
	
	Результат = 0;
	Для Разряд = 0 По 3 Цикл
		Результат = Число(Версия1[Разряд]) - Число(Версия2[Разряд]);
		Если Результат <> 0 Тогда
			Возврат Результат;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура Проверить() Экспорт
	//Сообщить(СравнитьВерсии("1.0.0.0", Метаданные.Версия));
	
	// Установка идентификатора ИБ
	УстановитьИдентификаторИБ();
	
	// Заполнить код ИКПУ для накладных расходов
	Если ЗначениеЗаполнено(Справочники.ВидыТовара.НакладныеРасходы.КодИКПУ) = Ложь Тогда
		СправочникОбъект = Справочники.ВидыТовара.НакладныеРасходы.ПолучитьОбъект();
		СправочникОбъект.КодИКПУ = "11201001001000000";
		СправочникОбъект.Записать();
	КонецЕсли;
	
	// Заполнить код ИКПУ для финансовых скидок
	Если ЗначениеЗаполнено(Справочники.ВидыТовара.ФинансоваяСкидка.КодИКПУ) = Ложь Тогда
		СправочникОбъект = Справочники.ВидыТовара.ФинансоваяСкидка.ПолучитьОбъект();
		СправочникОбъект.КодИКПУ = "10499001018000000";
		СправочникОбъект.Записать();
	КонецЕсли;
КонецПроцедуры

Процедура УстановитьИдентификаторИБ()
	УстановитьПривилегированныйРежим(Истина);
	
	Если ПустаяСтрока(Константы.ИдентификаторИБ.Получить()) Тогда
		Константы.ИдентификаторИБ.Установить(XMLСтрока(Новый УникальныйИдентификатор));
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры
