
// Предопределенные
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НазнчаитьТипСвязанныхСТипомВозвратаРеквизитов();
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	Если Вопрос("Хотите обновить список возвратов?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		ТарыЗаполнитьНаСервере(Истина)
	КонецЕсли;
КонецПроцедуры

// Товары
&НаКлиенте
Процедура ТоварыТоварПриИзменении(Элемент)
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	//ТекСтрока.Цена = Ставки.Сложить(Справочники.Товары.Цена(ТекСтрока.Товар, "ЦенаБазовая", Дата), ТекСтрока.Товар.СтавкаНДС);
	ТоварыПересчитатьСтроку(ТекСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	ТоварыПересчитатьСтроку(ТекСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	ТоварыПересчитатьСтроку(ТекСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПересчитатьСтроку(ТекСтрока)
	ТекСтрока.Сумма = ТекСтрока.Количество * ТекСтрока.Цена;
КонецПроцедуры

// Тары
&НаСервере
Процедура ТарыЗаполнитьНаСервере(Очистить = Ложь)
	Если Очистить Тогда
		Объект.Тары.Очистить();
	КонецЕсли;
	
    Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	СальдоПоТаре.Товар КАК Тара,
		|	СУММА(СальдоПоТаре.КоличествоОстаток) КАК Количество
		|ИЗ
		|	РегистрНакопления.СальдоПоТаре.Остатки(&Дата, Контрагент = &Контрагент) КАК СальдоПоТаре
		|ГДЕ
		|	ИСТИНА
		|СГРУППИРОВАТЬ ПО
		|	СальдоПоТаре.Товар
		|УПОРЯДОЧИТЬ ПО
		|	СальдоПоТаре.Товар.Наименование"
	);

	Запрос.УстановитьПараметр("Дата", ОбщийМодульСервер.ПолучитьМоментВремениДокумента(Объект));
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаТара = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.Прямой);
	Пока ВыборкаТара.Следующий() Цикл
		СтарыеСтроки = Объект.Тары.НайтиСтроки(Новый Структура("Товар", ВыборкаТара.Тара));
		Если СтарыеСтроки.Количество() > 0 Тогда
			ТекСтрока = СтарыеСтроки[0];
		Иначе
			ТекСтрока = Объект.Тары.Добавить();
		КонецЕсли;
		ТекСтрока.Товар = ВыборкаТара.Тара;
		ТекСтрока.Сальдо = ВыборкаТара.Количество;
	КонецЦикла;
	
	Объект.Тары.Сортировать("Товар");
КонецПроцедуры

&НаКлиенте
Процедура ТарыЗаполнить(Кнопка)
	ТарыЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТарыОбновитьНаСервере()
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Сальдо.Товар КАК Тара,
	|	СУММА(Сальдо.КоличествоОстаток) КАК Количество
	|ИЗ
	|	РегистрНакопления.СальдоПоТаре.Остатки(&Дата, Контрагент = &Контрагент) КАК Сальдо
	|ГДЕ
	|	ИСТИНА");
	
	МассивТары = Новый Массив();
	Для Каждого ТекСтрока Из Объект.Тары Цикл
		МассивТары.Добавить(ТекСтрока.Товар);
	КонецЦикла;
	Запрос.Текст = Запрос.Текст + " И Сальдо.Товар В (&МассивТары)";
	Запрос.УстановитьПараметр("МассивТары", МассивТары);
	
	Запрос.Текст = Запрос.Текст + "
	|СГРУППИРОВАТЬ ПО
	|	Сальдо.Товар
	|УПОРЯДОЧИТЬ ПО
	|	Сальдо.Товар.Наименование";

	Запрос.УстановитьПараметр("Дата", Объект.Дата - 1);
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаТара = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.Прямой);
	Пока ВыборкаТара.Следующий() Цикл
		СтарыеСтроки = Объект.Тары.НайтиСтроки(Новый Структура("Товар", ВыборкаТара.Тара));
		Если СтарыеСтроки.Количество() > 0 Тогда
			ТекСтрока = СтарыеСтроки[0];
		Иначе
			ТекСтрока = Объект.Тары.Добавить();
		КонецЕсли;
		
		ТекСтрока.Товар = ВыборкаТара.Тара;
		ТекСтрока.Сальдо = ВыборкаТара.Количество;
	КонецЦикла;
	
	Объект.Тары.Сортировать("Товар");
КонецПроцедуры

&НаКлиенте
Процедура ТарыОбновить(Кнопка)
	ТарыОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТарыУдалитьПС(Кнопка)
	ПустыеСтроки = Объект.Тары.НайтиСтроки(Новый Структура("Количество", 0)); 
	Для Каждого Строка Из ПустыеСтроки Цикл 
		Объект.Тары.Удалить(Строка); 
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТарыТТН(Кнопка)
	ФактурыКлиент.СформироватьТТНПоТаре(Объект);
КонецПроцедуры

&НаКлиенте
Процедура ТарыАктПП(Кнопка)
	ФактурыКлиент.СформироватьАктПППоТаре(Объект);
КонецПроцедуры

&НаКлиенте
Процедура ТарыФактура(Кнопка)
	ФактурыКлиент.СформироватьСчетФактуру(Объект);
КонецПроцедуры

&НаКлиенте
Процедура ТарыТоварПриИзменении(Элемент)
	ТекСтрока = Элементы.Тары.ТекущиеДанные;
	//ТекСтрока.Цена = Ставки.Сложить(Справочники.Товары.Цена(ТекСтрока.Товар, "ЦенаБазовая", Дата), ТекСтрока.Товар.СтавкаНДС);
КонецПроцедуры

&НаКлиенте
Процедура ТарыКоличествоПриИзменении(Элемент)
	ТекСтрока = Элементы.Тары.ТекущиеДанные;
	ТекСтрока.Сумма = ТекСтрока.Количество * ТекСтрока.Цена;
КонецПроцедуры

&НаКлиенте
Процедура ТарыЦенаПриИзменении(Элемент)
	ТекСтрока = Элементы.Тары.ТекущиеДанные;
	ТекСтрока.Сумма = ТекСтрока.Количество * ТекСтрока.Цена;
КонецПроцедуры

&НаКлиенте
Процедура ТарыПослеУдаления(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура ТарыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
КонецПроцедуры

// Итоги
&НаКлиенте
Процедура ОбновитьИтоги()
	КоличествоТовара = Объект.Товары.Итог("Количество");
	СуммаТовара = Объект.Товары.Итог("Сумма");
	
	КоличествоТары = Объект.Тары.Итог("Количество");
	СуммаТары = Объект.Тары.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ТипВозвратаПриИзменении(Элемент)
	НазнчаитьТипСвязанныхСТипомВозвратаРеквизитов();
КонецПроцедуры

&НаКлиенте
Процедура НазнчаитьТипСвязанныхСТипомВозвратаРеквизитов()
	МассивТипов = Новый Массив();
	
	Если Объект.ТипВозврата = ПредопределенноеЗначение("Перечисление.ТипыВозврата.Приход") Тогда
		МассивТипов.Добавить(Тип("СправочникСсылка.Сотрудники"));
		МассивТипов.Добавить(Тип("СправочникСсылка.ТранспортныеСредства"));
	Иначе
		МассивТипов.Добавить(Тип("Строка"));
	КонецЕсли;

	Элементы.Водитель.ОграничениеТипа = Новый ОписаниеТипов(МассивТипов);
	Элементы.Автомашина.ОграничениеТипа = Новый ОписаниеТипов(МассивТипов);
КонецПроцедуры
