
Функция Сериализовать(Данные) Экспорт
	Попытка
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Unix, Символы.Таб));
		
		ДобавитьЗаписи(ЗаписьJSON, Данные);
		
		Возврат ЗаписьJSON.Закрыть();
	Исключение
		ВызватьИсключение;
	КонецПопытки;
КонецФункции

Функция ДобавитьЗаписи(ЗаписьJSON, Данные)
	Если ТипЗнч(Данные) = Тип("Структура") Тогда
		ЗаписьJSON.ЗаписатьНачалоОбъекта();
		
		Для Каждого Элемент Из Данные Цикл
			ЗаписьJSON.ЗаписатьИмяСвойства(Элемент.Ключ); 
			ДобавитьЗаписи(ЗаписьJSON, Элемент.Значение);
		КонецЦикла;
		
		ЗаписьJSON.ЗаписатьКонецОбъекта();
	ИначеЕсли ТипЗнч(Данные) = Тип("Массив") Тогда
		ЗаписьJSON.ЗаписатьНачалоМассива();
		
		Для Каждого Элемент Из Данные Цикл 
			ДобавитьЗаписи(ЗаписьJSON, Элемент);
		КонецЦикла;
		
		ЗаписьJSON.ЗаписатьКонецМассива();
	ИначеЕсли ТипЗнч(Данные) = Тип("Булево") ИЛИ ТипЗнч(Данные) = Тип("Число") ИЛИ ТипЗнч(Данные) = Тип("Неопределено") Тогда
		ЗаписьJSON.ЗаписатьЗначение(Данные);
	Иначе
		ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(Данные));
	КонецЕсли;
КонецФункции

Функция Десериализовать(Строка, ПрочитатьВСоответствие = Ложь) Экспорт
	Попытка
		// Обработка ответа JSON
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Строка);
		
		// Десериализация JSON
		Результат = ПрочитатьJSON(ЧтениеJSON, ПрочитатьВСоответствие);
		
		// Распознование ответа сервера в формате json
		Если ТипЗнч(Результат) = Тип("Структура") ИЛИ ТипЗнч(Результат) = Тип("Массив") ИЛИ ТипЗнч(Результат) = Тип("Соответствие") Тогда
			Возврат Результат;
		Иначе
			ВызватьИсключение "Ошибка JSON: Не удалось десериализовать данных.";
		КонецЕсли;
	Исключение
		ВызватьИсключение;
	КонецПопытки;
КонецФункции
