
Процедура Сформировать(ТабДок) Экспорт
	ТабДок.Очистить();
	
	Макет = ПолучитьМакет("Основной");

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьОбщийИтог = Макет.ПолучитьОбласть("ОбщиеИтоги");
	ОбластьТовар = Макет.ПолучитьОбласть("Товар");
	ОбластьЦена = Макет.ПолучитьОбласть("Цена");
	ОбластьКонтрагент = Макет.ПолучитьОбласть("Контрагент");
	ОбластьРегистратор = Макет.ПолучитьОбласть("Регистратор");
	
	ОбластьЗаголовок.Параметры.Период = ПредставлениеПериода(НачалоДня(Период.ДатаНачала), КонецДня(Период.ДатаОкончания));
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	//|	Ссылка.Дата КАК Дата,
	//|	Ссылка.Номер КАК Номер,
	//|	Ссылка КАК Документ,
	|	Ссылка.Контрагент КАК Контрагент,
	|	Ссылка.Контрагент.Код КАК КодКонтрагента,
	|	Товар КАК Товар,
	|	Количество КАК Количество,
	|	ЦенаОтпускная КАК Цена
	|ИЗ
	|	Документ.РеализацияТМЦ.Товары
	|ГДЕ
	|	Ссылка.Проведен = Истина
	|	И Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
	|	И Ссылка.Склад.НеВестиУчет = Ложь");
	
	Если ЗначениеЗаполнено(Товар) Тогда
		Запрос.Текст = Запрос.Текст + " И Товар = &Товар";
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + "
	|
	//|УПОРЯДОЧИТЬ ПО
	//|	Дата,
	//|	Номер
	|ИТОГИ
	|	СУММА(Количество)
	|ПО
	|	ОБЩИЕ,
	|	Товар,
	|	Цена,
	|	Контрагент";

	Запрос.УстановитьПараметр("Дата1", НачалоДня(Период.ДатаНачала));
	Запрос.УстановитьПараметр("Дата2", КонецДня(Период.ДатаОкончания));
	Запрос.УстановитьПараметр("Товар", Товар);

	РезультатЗапроса = Запрос.Выполнить();
	
	ТабДок.НачатьАвтогруппировкуСтрок();

	ВыборкаОбщийИтог = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаОбщийИтог.Следующий() Цикл
		ОбластьОбщийИтог.Параметры.Заполнить(ВыборкаОбщийИтог);
		ТабДок.Вывести(ОбластьОбщийИтог, ВыборкаОбщийИтог.Уровень());

		ВыборкаТовар = ВыборкаОбщийИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаТовар.Следующий() Цикл
			ОбластьТовар.Параметры.Заполнить(ВыборкаТовар);
			ТабДок.Вывести(ОбластьТовар, ВыборкаТовар.Уровень());
			
			ВыборкаЦена = ВыборкаТовар.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаЦена.Следующий() Цикл
				ОбластьЦена.Параметры.Заполнить(ВыборкаЦена);
				ТабДок.Вывести(ОбластьЦена, ВыборкаЦена.Уровень());
				
				Если ПоКонтрагентам Тогда
					ВыборкаКонтрагент = ВыборкаЦена.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаКонтрагент.Следующий() Цикл
						ОбластьКонтрагент.Параметры.Заполнить(ВыборкаКонтрагент);
						ТабДок.Вывести(ОбластьКонтрагент, ВыборкаКонтрагент.Уровень());
						
						Если ПоКонтрагентам Тогда
							
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;

	ТабДок.ЗакончитьАвтогруппировкуСтрок();

	// Показать
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.АвтоМасштаб = Истина;
КонецПроцедуры