
&НаСервере
Функция УмножитьКолонки(ТаблицаЗначений, Колонка1, Колонка2) Экспорт
	
КонецФункции

&НаСервере
Функция ПреобразоватьМассивВТаблицуЗначений(Массив) Экспорт

	ТЗ = Новый ТаблицаЗначений;

	Для Каждого СтрокаМассива Из Массив Цикл
		Для Каждого ЭлементМассива Из СтрокаМассива Цикл
			Если ТЗ.Колонки.Найти(ЭлементМассива.Ключ) = Неопределено Тогда
				ТЗ.Колонки.Добавить(ЭлементМассива.Ключ);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Для Каждого СтрокаМассива Из Массив Цикл
		НоваяСтрока = ТЗ.Добавить();
		Для Каждого ЭлементМассива Из СтрокаМассива Цикл
			НоваяСтрока[ЭлементМассива.Ключ] = ЭлементМассива.Значение;
		КонецЦикла;
	КонецЦикла;

	Возврат ТЗ;

КонецФункции

&НаСервере
Функция ПреобразоватьСтрокуТаблицыЗначенийВСтруктуру(СтрокаТаблицыЗначений) Экспорт
	Структура = Новый Структура;
	
	Если СтрокаТаблицыЗначений = Неопределено Тогда
		ВызватьИсключение "В функцию передано значение неопределено";
	КонецЕсли;
	
	Для Каждого Колонка Из СтрокаТаблицыЗначений.Владелец().Колонки Цикл
		Структура.Вставить(Колонка.Имя, СтрокаТаблицыЗначений[Колонка.Имя]);
	КонецЦикла;
	
	Возврат Структура;
КонецФункции

&НаСервере
Функция ЗаполнитьСтрокуТаблицыЗначенийСтруктурой(СтрокаТаблицыЗначений, Структура) Экспорт
	Для Каждого Реквизит Из Структура Цикл
		СтрокаТаблицыЗначений[Реквизит.Ключ] = Реквизит.Значение;
	КонецЦикла;
КонецФункции

&НаСервере
Функция ПолучитьТекущуюСтрокаТаблицыФормыКакСтрокуТаблицыЗначений(Коллекция, ИдентификаторСтроки) Экспорт
	Массив = Новый Массив;
	Массив.Добавить(Коллекция.НайтиПоИдентификатору(ИдентификаторСтроки));
	Возврат Коллекция.Выгрузить(Массив).Получить(ИдентификаторСтроки);
КонецФункции

&НаСервере
Функция ПолучитьСтрокуКоллекцииКакСтруктуру(Коллекция, Строка) Экспорт
	// TODO: Удалить эту функцию
	СтруктураСтроки = Новый Структура;
	
	Если ТипЗнч(Коллекция) = Тип("ДанныеФормыКоллекция") Тогда
		ТаблицаЗначений = Коллекция.Выгрузить();
	Иначе
		ТаблицаЗначений = Коллекция;
	КонецЕсли;
	
	Для каждого Колонка Из ТаблицаЗначений.Колонки Цикл
	    СтруктураСтроки.Вставить(Колонка.Имя, Строка[Колонка.Имя]);
	КонецЦикла;
	
	Возврат СтруктураСтроки;
КонецФункции

&НаСервере
Функция ПреобразоватьТаблицуЗначенийВМассивСтруктур(ТаблицаЗначений) Экспорт
	
	Массив = Новый Массив();
	
	СтруктураСтрокой = "";
	НужнаЗапятая 	 = Ложь;
	
	Для Каждого Колонка Из ТаблицаЗначений.Колонки Цикл
		
		Если НужнаЗапятая Тогда
			СтруктураСтрокой = СтруктураСтрокой + ",";
		КонецЕсли;
		
		СтруктураСтрокой = СтруктураСтрокой + Колонка.Имя;
		НужнаЗапятая     = Истина;
		
	КонецЦикла;
	
	Для Каждого Строка Из ТаблицаЗначений Цикл
		
		НоваяСтрока = Новый Структура(СтруктураСтрокой);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
		Массив.Добавить(НоваяСтрока);
		
	КонецЦикла;
	
	Возврат Массив;

КонецФункции
