
Функция ПолучитьПараметрыСеанса() Экспорт
	Результат = Новый Структура;
	
	Для Каждого Параметр Из Метаданные.ПараметрыСеанса Цикл
		Результат.Вставить(Параметр.Имя, ПараметрыСеанса[Параметр.Имя]);
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

Функция ПолучитьЗначениеРеквизита(Объект, Реквизит, ЗначениеПоУмолчанию = Неопределено) Экспорт
	Значение = Объект[Реквизит];
	Возврат ?(ЗначениеЗаполнено(Значение), Значение, ЗначениеПоУмолчанию);
КонецФункции

Функция ПолучитьЗначениеКонстанты(Константа, ЗначениеПоУмолчанию = Неопределено) Экспорт
	Значение = Константы[Константа].Получить();
	Возврат ?(ЗначениеЗаполнено(Значение), Значение, ЗначениеПоУмолчанию);
КонецФункции

Функция ПроверитьЛицензию(Дата, Контрагент, ВидРеализации, Организация) Экспорт
	Результат = Истина;
	
	Правила = Справочники.ВидыЛицензии.ПолучитьПравила(Организация, ВидРеализации);
	Если Правила.Количество() > 0 Тогда
		Для Каждого Правило Из Правила Цикл
			Результат = Ложь;
			
			Выборка = Справочники.Лицензии.Выбрать(,Контрагент,Новый Структура("ВидЛицензии", Правило));
			Пока Выборка.Следующий() Цикл
				Если Выборка.Срок >= Дата Тогда
					Результат = Истина;
				КонецЕсли;
			КонецЦикла;
			
			Если Результат = Ложь Тогда
				Сообщить("У выбранного контрагента не обнаружена действующая лицензия: """ + Правило.Наименование + """");
				
				Возврат Результат;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция ПроверитьПраваДоступа(Знач Источник) Экспорт
	ТекущийПользовательСистемы = ПользователиИнформационнойБазы.ТекущийПользователь();
	Если ТекущийПользовательСистемы.Роли.Содержит(Метаданные.Роли.Администратор) = Ложь Тогда
		Если Источник.Автор <> ПараметрыСеанса.Пользователь Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Истина;
КонецФункции

Функция ПолучитьМоментВремениДокумента(Знач Источник) Экспорт
	Если Источник.Проведен Тогда
		Возврат Новый Граница(Новый МоментВремени(Источник.Дата, Источник.Ссылка), ВидГраницы.Исключая);
	Иначе
		Возврат Новый Граница(Новый МоментВремени(Источник.Дата, Источник.Ссылка), ВидГраницы.Включая);
	КонецЕсли;
КонецФункции

Функция ПолучитьПериодКакМассив(НачПериода, КонПериода) Экспорт
	Список = Новый СписокЗначений;
	
	ТекДата = КонецДня(НачПериода);
    Пока ТекДата < КонецДня(КонПериода) Цикл
    	Список.Добавить(ТекДата);
		
		ТекДата = ТекДата + 60 * 60 * 24; 	
	КонецЦикла;
	
	Список.Добавить(ТекДата);
	
	Возврат Список;
КонецФункции

Функция ПолучитьКоличествоМесяцевМеждуДатами(ДатаНачала, ДатаКонца) Экспорт
    МесяцНачала = Месяц(ДатаНачала);
	МесяцКонца = Месяц(ДатаКонца);
	ЛетМеждуДатами = Год(ДатаКонца) - Год(ДатаНачала);
	РезультатВМесяцах = ЛетМеждуДатами * 12 - МесяцНачала + МесяцКонца;
	Возврат РезультатВМесяцах + 1;
КонецФункции
