
Процедура ОбработкаПроведения(Отказ, Режим)
	//// регистр Касса
	//Движения.Касса.Записывать = Истина;
	
	// регистр Сальдо
	Движения.Сальдо.Записывать = Истина;
	
	Для Каждого Строка Из Обороты Цикл
		// регистр Сальдо Приход
		Если Строка.Приход > 0 Тогда
			Движение = Движения.Сальдо.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.Контрагент = Строка.Контрагент;
			Движение.ТипВзаиморасчета = Перечисления.ТипыВзаиморасчета.Безнал;
			Движение.Примечание = глНайтиПримечания(Строка.Комментарий);
			Движение.Сумма = Строка.Приход;
			
			Движения.Задолженности.Записывать = Истина;
			Запись = Движения.Задолженности.Добавить();
			Запись.Период = Дата;
			Запись.Контрагент = Строка.Контрагент;
			Запись.Идентификатор = Новый УникальныйИдентификатор;
			Запись.Оплата = Истина;
		КонецЕсли;
		
		// регистр Сальдо Расход
		Если Строка.Расход > 0 Тогда
			Движение = Движения.Сальдо.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Контрагент = Строка.Контрагент;
			Движение.ТипВзаиморасчета = Перечисления.ТипыВзаиморасчета.Безнал;
			Движение.Примечание = глНайтиПримечания(Строка.Комментарий);
			Движение.Сумма = Строка.Расход;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	СуммаПриход = Обороты.Итог("Приход");
	СуммаРасход = Обороты.Итог("Расход");
КонецПроцедуры
