
Функция Получить(Ключ, Элемент = Неопределено) Экспорт
	Если Элемент = Неопределено Тогда
		Элемент = ПараметрыСеанса.Пользователь;
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ВременныеПараметры.Значение КАК Значение,
	|	ВременныеПараметры.Строка КАК Строка
	|ИЗ
	|	РегистрСведений.ВременныеПараметры КАК ВременныеПараметры
	|ГДЕ
	|	Элемент = &Элемент И Ключ = &Ключ И (Срок >= &Срок ИЛИ Срок = ДАТАВРЕМЯ(1, 1, 1))");
	
	Запрос.УстановитьПараметр("Элемент", Элемент);
	Запрос.УстановитьПараметр("Ключ", Ключ);
	Запрос.УстановитьПараметр("Срок", ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат ?(ЗначениеЗаполнено(Выборка.Значение), Выборка.Значение, Выборка.Строка);
	КонецЕсли;
КонецФункции

Функция Установить(Ключ, Значение, Срок = Неопределено, Элемент = Неопределено) Экспорт
	Если Элемент = Неопределено Тогда
		Элемент = ПараметрыСеанса.Пользователь;
	КонецЕсли;
	
	Запись = РегистрыСведений.ВременныеПараметры.СоздатьМенеджерЗаписи();
	Запись.Элемент = Элемент;
	Запись.Ключ = Ключ;
	
	Если ТипЗнч(Значение) = Тип("Строка") Тогда
		Запись.Строка = Значение;
	Иначе
		Запись.Значение = Значение;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Срок) Тогда
		Если ТипЗнч(Срок) = Тип("Дата") Тогда
			Запись.Срок = Срок;
		ИначеЕсли ТипЗнч(Срок) = Тип("Число") Тогда
			Запись.Срок = ТекущаяДата() + Срок;
		КонецЕсли;
	КонецЕсли;
	
	Запись.Записать(Истина);
КонецФункции

Функция Удалить(Ключ, Элемент = Неопределено) Экспорт
	Если Элемент = Неопределено Тогда
		Элемент = ПараметрыСеанса.Пользователь;
	КонецЕсли;
	
	Набор = РегистрыСведений.ВременныеПараметры.СоздатьНаборЗаписей();
	Набор.Отбор.Элемент.Установить(ПараметрыСеанса.Пользователь);
	Набор.Отбор.Ключ.Установить(Ключ);
	Набор.Прочитать();
	
	Для Индекс = 1 - Набор.Количество() По 0 Цикл
		Набор.Удалить(-Индекс);
	КонецЦикла;
	
	Набор.Записать();
КонецФункции
