
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
КонецПроцедуры

// Товары
&НаСервере
Процедура ТоварыЗаполнитьНаСервере()
	Объект.Товары.Очистить();
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Товары.Ссылка КАК Товар,
		|	СкидкиТоваров.Скидка КАК Скидка
		|ИЗ
		|	Справочник.Товары КАК Товары
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СкидкиТоваров.СрезПоследних(&Дата) КАК СкидкиТоваров ПО СкидкиТоваров.Товар = Товары.Ссылка
		|ГДЕ
		|	Товары.ЭтоГруппа = ЛОЖЬ И Товары.Ссылка В ИЕРАРХИИ (&ГруппаТоваров)
		|	И (Товары.ВидТовара.ТипТовара = Значение(Перечисление.ТипыТовара.Продукция) или Товары.ВидТовара.ТипТовара = Значение(Перечисление.ТипыТовара.Товар))
		|"
	);
	
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	Запрос.УстановитьПараметр("Канал", Объект.Канал);
	Запрос.УстановитьПараметр("Группа", Объект.Группа);
	Запрос.УстановитьПараметр("ГруппаТоваров", Объект.ГруппаТоваров);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.Товары.Добавить();
		НоваяСтрока.Товар = Выборка.Товар;
		НоваяСтрока.Скидка = Выборка.Скидка;
	КонецЦикла;
	
	Объект.Товары.Сортировать("Товар,Контрагент");
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЗаполнить(Кнопка)
	Если Объект.Товары.Количество() = 0 ИЛИ Вопрос("Таблица будет очищена и вновь заполнена, вы согласны?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		ТоварыЗаполнитьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыУстановить(Команда)
	Скидка = 0;
	
	Если ВвестиЧисло(Скидка, "Введите новую скидку (%)", 8, 4) Тогда
		МассивСтрок = Элементы.Товары.ВыделенныеСтроки;
		Для Каждого ИдентификаторСтроки Из МассивСтрок Цикл
			Строка = Объект.Товары.НайтиПоИдентификатору(ИдентификаторСтроки);
			Строка.Скидка = Скидка;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

//
&НаКлиенте
Процедура Обновить()
	
КонецПроцедуры
