
// Предопределенные
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
КонецПроцедуры

&НаСервере
Процедура ТоварыЗаполнитьНаСервере(Обновление)
	ТаблицаЗначений = Объект.Товары.Выгрузить();
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ОстаткиТовар.Товар КАК Товар,
	|	ОстаткиТовар.КоличествоОстаток КАК Остаток,
	|	ВЫБОР КОГДА ОстаткиТовар.КоличествоОстаток <> 0 ТОГДА (ОстаткиТовар.СуммаОстаток / ОстаткиТовар.КоличествоОстаток) ИНАЧЕ ЦеныТоваров.Цена КОНЕЦ КАК ЦенаБазовая
	|ИЗ
	|	РегистрНакопления.Остатки.Остатки(&Дата, Склад = &Склад И Порожняя = Ложь И Бронь = Ложь) КАК ОстаткиТовар
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныТоваров.СрезПоследних(&Дата, Тип = ""ЦенаБазовая"") КАК ЦеныТоваров ПО ЦеныТоваров.Товар.Ссылка = ОстаткиТовар.Товар.Ссылка
	|ГДЕ
	|	ОстаткиТовар.КоличествоОстаток <> 0 И (ОстаткиТовар.Товар.ВидТовара.ТипТовара = Значение(Перечисление.ТипыТовара.Продукция) ИЛИ ОстаткиТовар.Товар.ВидТовара.ТипТовара = Значение(Перечисление.ТипыТовара.Товар))");
	
	Если Обновление Тогда
		Запрос.Текст = Запрос.Текст + " И ОстаткиТовар.Товар В (&МассивТоваров)";
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + "
	|УПОРЯДОЧИТЬ ПО
	|	ОстаткиТовар.Товар.Наименование
	|ИТОГИ
	|	СУММА(Остаток),
	|	СУММА(ЦенаБазовая)
	|ПО
	|	Товар";

	Запрос.УстановитьПараметр("Дата", Объект.Дата + 1);
	Запрос.УстановитьПараметр("Склад", Объект.Склад);
	
	Если Обновление Тогда
		Запрос.УстановитьПараметр("МассивТоваров", ТаблицаЗначений.ВыгрузитьКолонку("Товар"));
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаТовар = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.Прямой);
	Пока ВыборкаТовар.Следующий() Цикл
		СтарыеСтроки = ТаблицаЗначений.НайтиСтроки(Новый Структура("Товар", ВыборкаТовар.Товар));
		Если СтарыеСтроки.Количество() > 0 Тогда
			ТекСтрока = СтарыеСтроки[0];
		ИначеЕсли НЕ Обновление Тогда
			ТекСтрока = ТаблицаЗначений.Добавить();
		КонецЕсли;
		
		ТекСтрока.Товар = ВыборкаТовар.Товар;
		ТекСтрока.Остаток = ВыборкаТовар.Остаток;
		ТекСтрока.Разница = ТекСтрока.Остаток - ТекСтрока.Количество;
		ТекСтрока.ЦенаБазовая = ВыборкаТовар.ЦенаБазовая;
	КонецЦикла;
	
	Если (НЕ Обновление) Тогда
		ТаблицаЗначений.Сортировать("Товар");
	КонецЕсли;
	
	Объект.Товары.Загрузить(ТаблицаЗначений);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЗаполнить(Кнопка)
	Если Объект.Склад.Пустая() Тогда
		Предупреждение("Не выбран склад!");
		Возврат;
	КонецЕсли;
	
	ТоварыЗаполнитьНаСервере(Ложь);
	Для Каждого ТекСтрока Из Объект.Товары Цикл
		ТоварыОбновитьСтроку(ТекСтрока);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыОбновить(Кнопка)
	Если Объект.Склад.Пустая() Тогда
		Предупреждение("Не выбран склад!");
		Возврат;
	КонецЕсли;
	
	ТоварыЗаполнитьНаСервере(Истина);
	Для Каждого ТекСтрока Из Объект.Товары Цикл
		ТоварыОбновитьСтроку(ТекСтрока);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыУдалитьПС(Кнопка)
	ПустыеСтроки = Объект.Товары.НайтиСтроки(Новый Структура("Записать", Ложь)); 
	Для Каждого Строка Из ПустыеСтроки Цикл 
		Объект.Товары.Удалить(Строка); 
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыТоварПриИзменении(Элемент)
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	
	ТоварыОбновитьСтроку(ТекСтрока);
	
	ТоварыПересчитатьСтроку(ТекСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	
	ТоварыПересчитатьСтроку(ТекСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыРазницаПриИзменении(Элемент)
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	ТекСтрока.Количество = ТекСтрока.Остаток - ТекСтрока.Разница;
	
	ТоварыПересчитатьСтроку(ТекСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	ТекСтрока.Записать = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыОбновитьСтроку(ТекСтрока)
	ТекСтрока.Остаток = РаботаСТоварами.Остаток(Объект.Склад, ТекСтрока.Товар, Объект.Дата);
	
	ТоварыПересчитатьСтроку(ТекСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПересчитатьСтроку(ТекСтрока)
	ТекСтрока.Разница = ТекСтрока.Остаток - ТекСтрока.Количество;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИтоги()
	Остаток = Объект.Товары.Итог("Остаток");
	Количество = Объект.Товары.Итог("Количество");
	Разница = Объект.Товары.Итог("Разница");
КонецПроцедуры
