
Функция ДобавитьНаценку(Знач СуммаБезНаценки, Знач Наценка) Экспорт
	Если ТипЗнч(Наценка) = Тип("СправочникСсылка.СтавкиНДС") Тогда
		Наценка = Наценка.Ставка;
	КонецЕсли;
	
	Наценка = ?(Наценка = Неопределено, 0, Наценка);
	
	Возврат СуммаБезНаценки * (100 + Наценка) / 100;
КонецФункции

Функция ВычитатьНаценку(Знач СуммаСНаценкой, Знач Наценка) Экспорт
	Если ТипЗнч(Наценка) = Тип("СправочникСсылка.СтавкиНДС") Тогда
		Наценка = Наценка.Ставка;
	КонецЕсли;
	
	Наценка = ?(Наценка = Неопределено, 0, Наценка);
	Возврат СуммаСНаценкой / ((100 + Наценка) / 100);
КонецФункции

Функция РассчитатьНаценку(Знач СуммаБезНаценки, Знач Наценка) Экспорт
	Если ТипЗнч(Наценка) = Тип("СправочникСсылка.СтавкиНДС") Тогда
		Наценка = Наценка.Ставка;
	КонецЕсли;
	
	Наценка = ?(Наценка = Неопределено, 0, Наценка);
	
	Возврат ВыделитьНаценку(ДобавитьНаценку(СуммаБезНаценки, Наценка), Наценка);
КонецФункции

Функция ВыделитьНаценку(Знач СуммаСНаценкой, Знач Наценка) Экспорт
	Если ТипЗнч(Наценка) = Тип("СправочникСсылка.СтавкиНДС") Тогда
		Наценка = Наценка.Ставка;
	КонецЕсли;
	
	Наценка = ?(Наценка = Неопределено, 0, Наценка);
	
	Возврат СуммаСНаценкой - ВычитатьНаценку(СуммаСНаценкой, Наценка);
КонецФункции

Функция ОпределитьНаценку(Знач СуммаСНаценкой, Знач СуммаБезНаценки) Экспорт
	СуммаБезНаценки = ?(СуммаБезНаценки = Неопределено, 0, СуммаБезНаценки);
	Возврат ?(СуммаБезНаценки <> 0, 100 * (СуммаСНаценкой / СуммаБезНаценки) - 100, 0);
КонецФункции

Функция Округлить(Знач Сумма, Знач Отрицательно = Ложь, Знач Медиана = 500) Экспорт
	Округление = 0;
	
	Если Сумма > 0 Тогда
		Если Отрицательно Тогда
			Округление = Окр(Сумма - Медиана, -3, РежимОкругления.Окр15как10) - Сумма;
		Иначе
			Округление = Окр(Сумма + Медиана, -3, РежимОкругления.Окр15как20) - Сумма;
		КонецЕсли;
	КонецЕсли;
	
	Если Округление = 1000 ИЛИ Округление = -1000 Тогда
		Округление = 0;
	КонецЕсли;
	
	Возврат Округление;
КонецФункции
