
&НаСервере
Процедура ОбновитьНаСервере(Сертификаты)
	Справочники.Сертификаты.Обновить(Сертификаты);
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	Сокет = Вебсокет.ПолучитьСокет();
	
	EImzo.Верифицировать(Сокет);
	
	Сертификаты = EImzo.ПолучитьСписокСертификатов(Сокет);

	ОбновитьНаСервере(Сертификаты);
	
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	Если ПользователиИБ.ЭтоАдминистратор() = Ложь Тогда
		Элементы.Список.ТолькоПросмотр = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры
