
Процедура ОбработкаПроведения(Отказ, Режим)
	// Подготовка регистров накопления 
	Движения.Остатки.Записывать = Истина;
	
	// Подготовка регистров сведения
	Движения.ЦеныТоваров.Записывать = Истина;
	Движения.ИсторияРеквизитов.Записывать = Истина;
	
	Для Каждого Строка Из Товары Цикл
		// Удаление НДС
		Движение = Движения.Остатки.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Склад = Строка.Склад;
		Движение.Товар = Строка.Товар;
		Движение.Количество = Строка.Количество;
		Движение.Сумма = Строка.СуммаПродажная;
		Движение.Порожняя = Ложь;
		
		// Удаление НДС
		Движение = Движения.Остатки.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Склад = Строка.Склад;
		Движение.Товар = Строка.Товар;
		Движение.Количество = Строка.Количество;
		Движение.Сумма = Строка.СуммаБезНДС;
		Движение.Порожняя = Ложь;
		
		Движение = Движения.ИсторияРеквизитов.Добавить();
		Движение.Период = Дата;
		Движение.Ссылка = Строка.Товар;
		Движение.Реквизит = "СтавкаНДС";
		Движение.Значение = Строка.СтавкаВключенногоНДС;
	КонецЦикла;
КонецПроцедуры
