
Функция Читать(ИмяФайла, Кодировка = Неопределено) Экспорт
	Если Кодировка = Неопределено Тогда
		Кодировка = КодировкаТекста.UTF8;
	КонецЕсли;
	
	ЧтениеТекста = Новый ЧтениеТекста(ИмяФайла, Кодировка, Символы.ПФ);
	Строка = ЧтениеТекста.Прочитать();
	ЧтениеТекста.Закрыть();
	
	Возврат Строка;
КонецФункции

Функция Записать(ИмяФайла, Контент, Кодировка = Неопределено) Экспорт
	Если Кодировка = Неопределено Тогда
		Кодировка = КодировкаТекста.UTF8;
	КонецЕсли;
	
	ЗаписьТекста = Новый ЗаписьТекста(ИмяФайла, Кодировка, Неопределено, Ложь, Символы.ПС);
	ЗаписьТекста.Записать(Контент);
	ЗаписьТекста.Закрыть();
КонецФункции