
// Шапка
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
КонецПроцедуры

&НаКлиенте
Процедура СтавкаНДСПриИзменении(Элемент)
	Если Вопрос("Хотите установить новую ставку для всех товаров?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		Для Каждого Строка Из Объект.Товары Цикл
			Строка.СтавкаВключенногоНДС = Объект.СтавкаНДС;
			ТоварыПересчитатьСтроку(Строка);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

// Товары
&НаСервере
Процедура ТоварыЗаполнитьНаСервере()
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Товар КАК Товар,
	|	Склад КАК Склад,
	|	СУММА(КоличествоОстаток) КАК Количество,
	|	СУММА(СуммаОстаток) КАК Сумма
	|ИЗ
	|	РегистрНакопления.Остатки.Остатки(&Дата, Порожняя = Ложь И Бронь = Ложь)
	|ГДЕ 
	|	Товар.ВидТовара.ТипТовара = ЗНАЧЕНИЕ(Перечисление.ТипыТовара.Продукция) ИЛИ Товар.ВидТовара.ТипТовара = ЗНАЧЕНИЕ(Перечисление.ТипыТовара.Товар)
	|СГРУППИРОВАТЬ ПО
	|	Товар,
	|	Склад
	|УПОРЯДОЧИТЬ ПО
	|	Товар.Наименование,
	|	Склад.Наименование
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(Сумма)
	|ПО
	|	Товар,
	|	Склад");
	
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	
	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаТовар = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаТовар.Следующий() Цикл
		ВыборкаСклад = ВыборкаТовар.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаСклад.Следующий() Цикл
			СтарыеСтроки = Объект.Товары.НайтиСтроки(Новый Структура("Товар,Склад", ВыборкаСклад.Товар, ВыборкаСклад.Склад));
			Если СтарыеСтроки.Количество() > 0 Тогда
				ТекСтрока = СтарыеСтроки[0];
			Иначе
				ТекСтрока = Объект.Товары.Добавить();
			КонецЕсли;
			
			ТекСтрока.Товар = ВыборкаСклад.Товар;
			ТекСтрока.Склад = ВыборкаСклад.Склад;
			ТекСтрока.Количество = ВыборкаСклад.Количество;
			ТекСтрока.СуммаПродажная = ВыборкаСклад.Сумма;
			ТекСтрока.ЦенаБазоваяСНДС = ТекСтрока.СуммаПродажная / ТекСтрока.Количество;
			ТекСтрока.СтавкаВключенногоНДС = ?(ТекСтрока.Товар.СтавкаНДС.Ставка > 0, ТекСтрока.Товар.СтавкаНДС, Объект.СтавкаНДС);
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЗаполнить(Кнопка)
	ТоварыЗаполнитьНаСервере();
	
	Для Каждого ТекСтрока Из Объект.Товары Цикл
		ТоварыПересчитатьСтроку(ТекСтрока);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыТоварПриИзменении(Элемент)
	Строка = Элементы.Товары.ТекущиеДанные;
	Строка.Количество = РаботаСтоварами.Остаток(Строка.Склад, Строка.Товар, Объект.Дата);
	ТоварыПересчитатьСтроку(Строка);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	Строка = Элементы.Товары.ТекущиеДанные;
	ТоварыПересчитатьСтроку(Строка);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаБазоваяСНДСПриИзменении(Элемент)
	Строка = Элементы.Товары.ТекущиеДанные;
	ТоварыПересчитатьСтроку(Строка);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСтавкаВключенногоНДСПриИзменении(Элемент)
	Строка = Элементы.Товары.ТекущиеДанные;
	ТоварыПересчитатьСтроку(Строка);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПродажнаяПриИзменении(Элемент)
	Строка = Элементы.Товары.ТекущиеДанные;
	Строка.ЦенаБазоваяСНДС = Строка.СуммаПродажная / Строка.Количество;
	ТоварыПересчитатьСтроку(Строка);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПересчитатьСтроку(Строка)
	Строка.СуммаПродажная = Строка.Количество * Строка.ЦенаБазоваяСНДС;
	Строка.СуммаБезНДС = Строка.СуммаПродажная / ((100 + Строка.СтавкаВключенногоНДС) / 100);
	Строка.СуммаНДС = Строка.СуммаПродажная - Строка.СуммаБезНДС;
	Строка.ЦенаБазоваяБезНДС = АрифметическиеФункции.ВычитатьНаценку(Строка.ЦенаБазоваяСНДС, Строка.СтавкаВключенногоНДС);
КонецПроцедуры

// Вспомагательные
&НаКлиенте
Процедура ОбновитьИтоги()
	Количество = Объект.Товары.Итог("Количество");
	СуммаБезНДС = Объект.Товары.Итог("СуммаБезНДС");
	СуммаНДС = Объект.Товары.Итог("СуммаНДС");
	СуммаПродажная = Объект.Товары.Итог("СуммаПродажная");
КонецПроцедуры
