
Функция Получить(Ссылка, Реквизит, Дата, ЗначениеПоУмолчанию = Неопределено) Экспорт
	Данные = РегистрыСведений.ИсторияРеквизитов.ПолучитьПоследнее(Дата, Новый Структура("Ссылка,Реквизит", Ссылка, Реквизит));
	Возврат ?(ЗначениеЗаполнено(Данные.Значение), Данные.Значение, ЗначениеПоУмолчанию);
КонецФункции

Функция Установить(Ссылка, Реквизит, Значение, Дата) Экспорт
	Движение = РегистрыСведений.ИсторияРеквизитов.СоздатьМенеджерЗаписи();
	Движение.Период = Дата;
	Движение.Ссылка = Ссылка;
	Движение.Реквизит = Реквизит;
	Движение.Значение = Значение;
КонецФункции
