
&НаСервере
Функция Сальдо(Контрагент, ТипВзаиморасчета, Дата) Экспорт
	Данные = РегистрыНакопления.Сальдо.Остатки(Дата, Новый Структура("Контрагент,ТипВзаиморасчета", Контрагент, ТипВзаиморасчета), "", "Сумма");
	Возврат Данные[0].Сумма;
КонецФункции

&НаСервере
Функция ПолучитьОсновнойДоговор(Контрагент, Дата) Экспорт
	Если ЗначениеЗаполнено(Контрагент.ОсновнойДоговор) И Контрагент.ОсновнойДоговор.Дата <= Дата И Контрагент.ОсновнойДоговор.Срок >= Дата Тогда
		Возврат Контрагент.ОсновнойДоговор;
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
		|	Договоры.Ссылка КАК Ссылка,
		|	Договоры.Владелец КАК Владелец,
		|	Договоры.ВидДоговора КАК ВидДоговора,
		|	Договоры.Номер КАК Номер,
		|	Договоры.Дата КАК Дата
		|ИЗ
		|	Справочник.Договоры КАК Договоры
		|ГДЕ
		|	Договоры.Владелец = &Владелец И Договоры.ПометкаУдаления = ЛОЖЬ
		|	И (КОНЕЦПЕРИОДА(Договоры.Дата, ДЕНЬ) <= &Дата ИЛИ Договоры.Дата = ДАТАВРЕМЯ(1, 1, 1))
		//|	И (НАЧАЛОПЕРИОДА(Договоры.Срок, ДЕНЬ) >= &Дата ИЛИ Договоры.Срок = ДАТАВРЕМЯ(1, 1, 1))
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата УБЫВ,
		|	Номер УБЫВ");
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Владелец", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла;
КонецФункции

&НаСервере
Функция ПолучитьОсновнойБанковскийСчет(Контрагент) Экспорт
	Если ЗначениеЗаполнено(Контрагент.ОсновнойБанковскийСчет) Тогда
		Возврат Контрагент.ОсновнойБанковскийСчет;
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
		|	БанковскиеСчета.Ссылка КАК Ссылка,
		|	БанковскиеСчета.Владелец КАК Владелец,
		|	БанковскиеСчета.Номер КАК Номер
		|ИЗ
		|	Справочник.БанковскиеСчета КАК БанковскиеСчета
		|ГДЕ
		|	БанковскиеСчета.Владелец = &Владелец И БанковскиеСчета.ПометкаУдаления = ЛОЖЬ И БанковскиеСчета.Номер <> """"
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номер УБЫВ");
	
	Запрос.УстановитьПараметр("Владелец", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла;
КонецФункции
