
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Дата") тогда
		Дата = Параметры.Дата;
	Иначе
		Дата = ТекущаяДата();
	КонецЕсли;
	
	Если Параметры.Свойство("ТипВзаиморасчета") тогда
		ТипВзаиморасчета = Параметры.ТипВзаиморасчета;
	ИначеЕсли Параметры.Свойство("ВидРеализации") тогда
		ТипВзаиморасчета = Параметры.ВидРеализации.ТипВзаиморасчета;
	Иначе
		ТипВзаиморасчета = Перечисления.ТипыВзаиморасчета.Нал;
	КонецЕсли;
	
	Список.Параметры.УстановитьЗначениеПараметра("Дата", Дата);
	Список.Параметры.УстановитьЗначениеПараметра("ТипВзаиморасчета", ТипВзаиморасчета);
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Список.Параметры.УстановитьЗначениеПараметра("Дата", Дата);
КонецПроцедуры

&НаКлиенте
Процедура ТипВзаиморасчетаПриИзменении(Элемент)
	Список.Параметры.УстановитьЗначениеПараметра("ТипВзаиморасчета", ТипВзаиморасчета);
КонецПроцедуры
