
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
    ПроверитьДокумент(ПараметрКоманды);
	
	Попытка
		МодульЭДО.УдалитьДокумент(ПараметрКоманды);
	Исключение
		ВызватьИсключение;
	КонецПопытки;
	
	Предупреждение("Документ успешно удален на системе ЭДО.");
КонецПроцедуры

Процедура ПроверитьДокумент(Документ) Экспорт
	Оператор = Константы.ЭДО_ОсновнойОператор.Получить();
	
	ИмяОператора = СокрЛП(Оператор);
	
	ДокументЭДО = ЭлектронныеДокументы.Получить(Документ);
	
	Если ЗначениеЗаполнено(ДокументЭДО) = Ложь Тогда
		ВызватьИсключение ИмяОператора + ": Документ не был отправлен на ЭДО.";
	ИначеЕсли ДокументЭДО.Оператор <> Оператор Тогда
		ВызватьИсключение ИмяОператора + ": Документ был отправлен на ЭДО через систему '" + СокрЛП(ДокументЭДО.Оператор) + "'.";
	КонецЕсли;
КонецПроцедуры
