
Процедура ПередЗаписью(Отказ)
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ДатаНачала > ДатаОкончания Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Неправильная дата начала.";
		Сообщение.Поле = "ДатаНачала";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		Отказ = Истина;
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Неправильная дата окончания.";
		Сообщение.Поле = "ДатаОкончания";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	
	Если Активный Тогда
		Запрос = Новый Запрос("
			|ВЫБРАТЬ
			|	Нагрузки.Ссылка КАК Нагрузка
			|ИЗ
			|	Справочник.Нагрузки КАК Нагрузки
			|ГДЕ
			|	Нагрузки.Ссылка <> &Ссылка
			|	И Нагрузки.Активный
			|	И (&ДатаНачала МЕЖДУ Нагрузки.ДатаНачала И Нагрузки.ДатаОкончания ИЛИ &ДатаОкончания МЕЖДУ Нагрузки.ДатаНачала И Нагрузки.ДатаОкончания)
			|	И Нагрузки.Товары.Товар В (&Товары)
			|"
		);
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
		Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
		Запрос.УстановитьПараметр("Товары", Товары.ВыгрузитьКолонку("Товар"));
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Неуникальная нагрузка: существуют схожие нагрузки в заданном интервале.";
			Сообщение.Поле = "";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если Товары.Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не указаны условия.";
		Сообщение.Поле = "Товары";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		Отказ = Истина;;
	КонецЕсли;
КонецПроцедуры
