
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Список.ПроизвольныйЗапрос = Истина;
	
	ДополнительныеСвязи = Новый Массив;
	ДополнительныеСвязи.Добавить("ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Остатки.Остатки(КОНЕЦПЕРИОДА(&Дата, ДЕНЬ), Склад = &Склад И Порожняя = Ложь И Бронь = Ложь) КАК РегистрОстатки ПО РегистрОстатки.Товар = СправочникТовары.Ссылка");
	ДополнительныеСвязи.Добавить("ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРеквизитов.СрезПоследних(КОНЕЦПЕРИОДА(&Дата, ДЕНЬ), Реквизит = ""СтавкаНДС"") КАК ИсторияРеквизитовСтавкаНДС ПО ИсторияРеквизитовСтавкаНДС.Ссылка = СправочникТовары.Ссылка");
	
	ДополнительныеПоля = Новый Массив;
	ДополнительныеПоля.Добавить("ИсторияРеквизитовСтавкаНДС.Значение КАК СтавкаНДС");
	ДополнительныеПоля.Добавить("РегистрОстатки.КоличествоОстаток КАК Остаток");
	
	ВыборкаВидовСтоимости = Справочники.ВидыСтоимости.Выбрать();
	Пока ВыборкаВидовСтоимости.Следующий() Цикл
		Если ВыборкаВидовСтоимости.ВыводитьВФормеСписка Тогда
			ДополнительныеСвязи.Добавить("ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныТоваров.СрезПоследних(КОНЕЦПЕРИОДА(&Дата, ДЕНЬ), Тип = """ + ВыборкаВидовСтоимости.Наименование + """) КАК ЦеныТоваров" + ВыборкаВидовСтоимости.Наименование + " ПО ЦеныТоваров" + ВыборкаВидовСтоимости.Наименование + ".Товар = СправочникТовары.Ссылка");
			ДополнительныеПоля.Добавить("ЦеныТоваров" + ВыборкаВидовСтоимости.Наименование + ".Цена КАК " + ВыборкаВидовСтоимости.Наименование);
		КонецЕсли;
	КонецЦикла;
	
	ТекстЗапроса = "ВЫБРАТЬ " + Символы.ПС + Символы.Таб + "СправочникТовары.*,";
	
	ТекстЗапроса = ТекстЗапроса + Символы.ПС + Символы.Таб + СтрСоединить(ДополнительныеПоля, "," + Символы.ПС + Символы.Таб);
	
	ТекстЗапроса = ТекстЗапроса + Символы.ПС + "ИЗ" + Символы.ПС + Символы.Таб + "Справочник.Товары КАК СправочникТовары";
	
	ТекстЗапроса = ТекстЗапроса + Символы.ПС + Символы.Таб + СтрСоединить(ДополнительныеСвязи, "," + Символы.ПС + Символы.Таб);
	
	Список.ТекстЗапроса = ТекстЗапроса;
	
	ВыборкаВидовСтоимости = Справочники.ВидыСтоимости.Выбрать();
	Пока ВыборкаВидовСтоимости.Следующий() Цикл
		Если ВыборкаВидовСтоимости.ВыводитьВФормеСписка Тогда
			НовыйЭлемент = Элементы.Добавить(ВыборкаВидовСтоимости.Наименование, Тип("ПолеФормы"), Элементы.Список);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;      
			НовыйЭлемент.ПутьКДанным = "Список." + ВыборкаВидовСтоимости.Наименование;
			НовыйЭлемент.Заголовок = ВыборкаВидовСтоимости.Заголовок;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
