
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Номер");
	Поля.Добавить("Дата");
	Поля.Добавить("Доставщик");
	Поля.Добавить("Автомашина");
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Представление = Данные.Номер + " от " + Формат(Данные.Дата, "ДФ=dd.MM.yyyy") + " [" + Данные.Доставщик.ПолноеНаименование + ", " + Данные.Автомашина.Наименование + " " + Данные.Автомашина.Марка + "]";
КонецПроцедуры
