
Процедура Сформировать(ТабДок) Экспорт
	ТабДок.Очистить();
	
	Макет = ПолучитьМакет("Основной");

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьОбщийИтог = Макет.ПолучитьОбласть("ОбщиеИтоги");
	ОбластьАгент = Макет.ПолучитьОбласть("Агент");
	ОбластьТовар = Макет.ПолучитьОбласть("Товар");
	ОбластьРегистратор = Макет.ПолучитьОбласть("Регистратор");
	
	ОбластьЗаголовок.Параметры.Период = ПредставлениеПериода(НачалоДня(Период.ДатаНачала), КонецДня(Период.ДатаОкончания));
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ЗаказАгентаТовары.Ссылка.Агент КАК Агент,
		|	ЗаказАгентаТовары.Товар КАК Товар,
		|	ЗаказАгентаТовары.Ссылка КАК Регистратор,
		|	ЗаказАгентаТовары.Количество КАК Количество,
		|	ЗаказАгентаТовары.СуммаПродажная КАК СуммаПродажная,
		|	ЗаказАгентаТовары.СуммаОтпускная КАК СуммаОтпускная
		|ИЗ
		|	Документ.ЗаказАгента.Товары КАК ЗаказАгентаТовары
		|ГДЕ
		|	ЗаказАгентаТовары.Ссылка.Проведен
		|	И ЗаказАгентаТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ЗаказАгентаТовары.Количество <> 0
		|УПОРЯДОЧИТЬ ПО
		|	ЗаказАгентаТовары.Товар.ПорядокСортировки,
		|	ЗаказАгентаТовары.Ссылка.Дата
		|ИТОГИ
		|	СУММА(Количество),
		|	СУММА(СуммаПродажная),
		|	СУММА(СуммаОтпускная)
		|ПО
		|	ОБЩИЕ,
		|	Агент,
		|	Товар,
		|	Регистратор
		|"
	);
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(Период.ДатаНачала));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(Период.ДатаОкончания));

	РезультатЗапроса = Запрос.Выполнить();

	ТабДок.НачатьАвтогруппировкуСтрок();

	ВыборкаОбщийИтог = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если ВыборкаОбщийИтог.Следующий() Тогда
		ОбластьОбщийИтог.Параметры.Заполнить(ВыборкаОбщийИтог);
		ТабДок.Вывести(ОбластьОбщийИтог, ВыборкаОбщийИтог.Уровень());
	
		ВыборкаАгент = ВыборкаОбщийИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	    Пока ВыборкаАгент.Следующий() Цикл
			ОбластьАгент.Параметры.Заполнить(ВыборкаАгент);
			ТабДок.Вывести(ОбластьАгент, ВыборкаАгент.Уровень());
			
			ВыборкаТовар = ВыборкаАгент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		    Пока ВыборкаТовар.Следующий() Цикл
				ОбластьТовар.Параметры.Заполнить(ВыборкаТовар);
				ТабДок.Вывести(ОбластьТовар, ВыборкаТовар.Уровень());
				
				Если Подробно Тогда
					ВыборкаРегистратор = ВыборкаТовар.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				    Пока ВыборкаРегистратор.Следующий() Цикл
						ОбластьРегистратор.Параметры.Заполнить(ВыборкаРегистратор);
						ТабДок.Вывести(ОбластьРегистратор, ВыборкаРегистратор.Уровень());
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;

	ТабДок.ЗакончитьАвтогруппировкуСтрок();

	// Показать
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.АвтоМасштаб = Истина;
КонецПроцедуры