
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Объект.Пароль = "";
	
	Если ПользователиИБ.ЭтоАдминистратор() = Ложь Тогда
		Если Объект.Ссылка <> ПользователиИБ.ТекущийПользователь() Тогда
			Элементы.Сертификат.ТолькоПросмотр = Истина;
		КонецЕсли;
		
		Если Объект.Наименование = "Администратор" Тогда
			Элементы.Наименование.ТолькоПросмотр = Истина;
			Элементы.Сотрудник.ТолькоПросмотр = Истина;
			Элементы.Активность.ТолькоПросмотр = Истина;
			Элементы.Видимость.ТолькоПросмотр = Истина;
			Элементы.Мобильный.ТолькоПросмотр = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Модифицированность = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ДоступыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДоступыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры
