
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	// регистр Касса
	Движения.Касса.Записывать = Истина;
	
	// регистр Сальдо
	Движения.Сальдо.Записывать = Истина;
	
	// регистр Доходы
	Движения.Доходы.Записывать = Истина;
	
	Для Каждого Строка Из Обороты Цикл
		Движения.Задолженности.Записывать = Истина;
		Запись = Движения.Задолженности.Добавить();
		Запись.Период = Дата;
		Запись.Контрагент = Строка.Контрагент;
		Запись.Идентификатор = Новый УникальныйИдентификатор;
		Запись.Оплата = Истина;
		
		// регистр Касса Приход
		Движение = Движения.Касса.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Касса = Строка.Касса;
		Движение.Статья = Справочники.СтатьиДвиженияДенежныхСредств.ОборотПриход;
		Движение.Примечание = глНайтиПримечания(Строка.Комментарий);
		Движение.Сумма = Строка.СуммаВаловая;
		
		// регистр Сальдо Приход
		Если Строка.УчетПоБезналу Тогда
			Движение = Движения.Сальдо.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.Контрагент = Строка.Контрагент;
			Движение.ТипВзаиморасчета = Перечисления.ТипыВзаиморасчета.Безнал;
			Движение.ПоСписании = Истина;
			Движение.Примечание = глНайтиПримечания(Строка.Комментарий);
			Движение.Сумма = Строка.СуммаВаловая;
		КонецЕсли;
		
		Если Строка.УчетПоНалу Тогда
			Движение = Движения.Сальдо.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.Контрагент = Строка.Контрагент;
			Движение.ТипВзаиморасчета = Перечисления.ТипыВзаиморасчета.Нал;
			Движение.Примечание = глНайтиПримечания(Строка.Комментарий);
			Движение.Сумма = Строка.СуммаЧистая;
		КонецЕсли;
		
		Если Строка.СуммаВаловая <> Строка.СуммаЧистая Тогда
			// регистр Доходы Приход
			Движение = Движения.Доходы.Добавить();
			
			Если Строка.СуммаВаловая > Строка.СуммаЧистая Тогда
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Иначе
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			КонецЕсли;
			
			Движение.Период = Дата;
			Движение.Статья = Справочники.СтатьиДоходовИРасходов.БанковскаяОперация;
			Движение.Реализация = Истина;
			Движение.Примечание = глНайтиПримечания(Строка.Комментарий);
			
			Если Строка.СуммаВаловая > Строка.СуммаЧистая Тогда
				Движение.Сумма = Строка.СуммаВаловая - Строка.СуммаЧистая;
			Иначе
				Движение.Сумма = Строка.СуммаЧистая - Строка.СуммаВаловая;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	СуммаВаловая = Обороты.Итог("СуммаВаловая");
	СуммаЧистая = Обороты.Итог("СуммаЧистая");
КонецПроцедуры
