
Функция ЭтоАдминистратор() Экспорт
	Возврат ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(Метаданные.Роли.Администратор);
КонецФункции

Функция СодержитРоль(Роль) Экспорт
	Возврат ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(Метаданные.Роли[Роль]);
КонецФункции

Функция ТекущийПользователь() Экспорт
	Возврат Справочники.Пользователи.ПолучитьСсылку(ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор);
КонецФункции

Функция АктивныйПользователь() Экспорт
	Возврат Справочники.Пользователи.ПолучитьСсылку(ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор).Активность;
КонецФункции
