
&НаСервере
Процедура ЗаполнитьНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.Заполнить(СписокДокументов, Период, Организация);
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере(ТабДок)
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.Сформировать(ТабДок, СписокДокументов);
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	ТабДок = Новый ТабличныйДокумент;
	
	СформироватьНаСервере(ТабДок);

	ТабДок.Показать();
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтметитьВсе(Команда)
	Для Каждого Строка Из СписокДокументов Цикл
		Строка.Экспортировать = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КомандаСнятьВсе(Команда)
	Для Каждого Строка Из СписокДокументов Цикл
		Строка.Экспортировать = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры
