
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	Если Параметры.Свойство("СтандартнаяОбработка") Тогда
		СтандартнаяОбработка = Параметры.СтандартнаяОбработка;
	Иначе
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
	Если СтандартнаяОбработка = Ложь Тогда
		ДанныеВыбора = Новый СписокЗначений;
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		|   Элементы.Ссылка КАК Ссылка,
		|   Элементы.Проект КАК Проект,
		|	Элементы.Наименование КАК Наименование,
		|	Элементы.ПолноеНаименование КАК ПолноеНаименование
	    |ИЗ
	    |   Справочник.Контрагенты КАК Элементы
	    |ГДЕ
		|	Элементы.Код ПОДОБНО &СтрокаПоиска ИЛИ Элементы.ИНН ПОДОБНО &СтрокаПоиска ИЛИ Элементы.ПИНФЛ ПОДОБНО &СтрокаПоиска
		|	ИЛИ Элементы.Наименование ПОДОБНО &СтрокаПоиска
		|	ИЛИ Элементы.ПолноеНаименование ПОДОБНО &СтрокаПоиска
		|	ИЛИ Элементы.Ориентир ПОДОБНО &СтрокаПоиска
		|");
		
		Если Константы.Контрагенты_ТранслитерацияВПоиске.Получить() Тогда
			Запрос.Текст = Запрос.Текст + "
			|	ИЛИ Элементы.Наименование ПОДОБНО &СтрокаПоискаТранслит
			|	ИЛИ Элементы.ПолноеНаименование ПОДОБНО &СтрокаПоискаТранслит
			|	ИЛИ Элементы.Ориентир ПОДОБНО &СтрокаПоискаТранслит
			|";
		КонецЕсли;
		
		Запрос.Текст = Запрос.Текст + "
		|";
		
		Если Константы.Контрагенты_ПолнотекстовыйПоиск.Получить() Тогда
		    Запрос.УстановитьПараметр("СтрокаПоиска", "%" + Параметры.СтрокаПоиска + "%");
			
			Если Константы.Контрагенты_ТранслитерацияВПоиске.Получить() Тогда
				Запрос.УстановитьПараметр("СтрокаПоискаТранслит", "%" + СтроковыеФункции.Транслитерация(Параметры.СтрокаПоиска) + "%");
			КонецЕсли;
		Иначе
		    Запрос.УстановитьПараметр("СтрокаПоиска", "" + Параметры.СтрокаПоиска + "%");
			
			Если Константы.Контрагенты_ТранслитерацияВПоиске.Получить() Тогда
				Запрос.УстановитьПараметр("СтрокаПоискаТранслит", "" + СтроковыеФункции.Транслитерация(Параметры.СтрокаПоиска) + "%");
			КонецЕсли;
		КонецЕсли;
	    
	    Выборка = Запрос.Выполнить().Выбрать();
	    
		Пока Выборка.Следующий() Цикл
			Если Константы.Контрагенты_ИскатьПоПолномуНаименованию.Получить() Тогда
				ДанныеВыбора.Добавить(Выборка.Ссылка, Выборка.Наименование + " (" + Выборка.ПолноеНаименование + ") [" + Выборка.Проект.Наименование + "]");
			Иначе
	        	ДанныеВыбора.Добавить(Выборка.Ссылка, Выборка.Наименование + " [" + Выборка.Проект.Наименование + "]");
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
