
Процедура ПередЗаписью(Отказ)
	Если (НЕ ЭтоГруппа) Тогда
		Зоны.Свернуть("Зона");
		
		Для Каждого Строка Из Зоны Цикл
			Если глСсылкаСуществует(Строка.Зона) = Ложь Тогда
				Зоны.Удалить(Строка);
			КонецЕсли;
		КонецЦикла;
		
		Если (НЕ ПометкаУдаления) Тогда
			// Контроль уникальности ИНН
			Если Константы.Контрагенты_КонтрольУникальностиИНН.Получить() Тогда
				Если (НЕ ПустаяСтрока(ИНН)) Тогда
					КонтрагентПоИНН = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН", ИНН);
					Если (Не КонтрагентПоИНН.Пустая()) и КонтрагентПоИНН.Ссылка <> Ссылка Тогда
						Сообщить("ИНН не уникален: " + ИНН);
						
						Отказ = Истина;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			// Контроль уникальности ПИНФЛ
			Если Константы.Контрагенты_КонтрольУникальностиПИНФЛ.Получить() Тогда
				Если (НЕ ПустаяСтрока(ПИНФЛ)) Тогда
					КонтрагентПоПИНФЛ = Справочники.Контрагенты.НайтиПоРеквизиту("ПИНФЛ", ПИНФЛ);
					Если (Не КонтрагентПоПИНФЛ.Пустая()) и КонтрагентПоПИНФЛ.Ссылка <> Ссылка Тогда
						Сообщить("ПИНФЛ не уникален: " + ПИНФЛ);
						
						Отказ = Истина;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Если ПустаяСтрока(ПолноеНаименование) Тогда
				ПолноеНаименование = СокрЛП(Наименование);
			КонецЕсли;
		КонецЕсли;
		
		Если Константы.Контрагенты_ТранслитерацияНаименованияПриЗаписи.Получить() Тогда
			Наименование = СтроковыеФункции.Транслитерация(Наименование);
		КонецЕсли;
		
		Если Константы.Контрагенты_ТрансформироватьНаименованияВВерхнийРегистр.Получить() Тогда
			Наименование = ВРег(СокрЛП(Наименование));
			ПолноеНаименование = ВРег(СокрЛП(ПолноеНаименование));
		КонецЕсли;
		
		Если СтрДлина(СокрЛП(ИНН)) = 14 Тогда
			ПИНФЛ = СокрЛП(ИНН);
			ИНН = "";
		КонецЕсли;
		
		Если СтрДлина(СокрЛП(ПИНФЛ)) = 9 Тогда
			ИНН = СокрЛП(ПИНФЛ);
			ПИНФЛ = "";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ИНН) Тогда
			ТипКонтрагента = Перечисления.ТипыКонтрагента.ЮридическоеЛицо;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПИНФЛ) Тогда
			ТипКонтрагента = Перечисления.ТипыКонтрагента.ФизическоеЛицо;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ИНН) = Ложь И ЗначениеЗаполнено(ПИНФЛ) = Ложь Тогда
			ТипКонтрагента = Перечисления.ТипыКонтрагента.Хозяйственный;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Если ЭтоГруппа = Ложь Тогда
		ИНН = "";
		ПИНФЛ = "";
		ПолноеНаименование = "";
		Телефон = "";
		КонтактноеЛицо = "";
		Адрес = "";
		Руководитель = "";
		Бухгалтер = "";
		КодПНДС = "";
		ДополнительныйКод = "";
	КонецЕсли;
КонецПроцедуры
