
&НаКлиенте
Процедура ВозвратыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВозвратыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОтгрузкаПриИзменении(Элемент)
	Если Вопрос("Хотите обновить список возвратов?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		ВозвратыЗаполнить();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВозвратыЗаполнить()
	Объект.Возвраты.Очистить();
	
	Для Каждого НакладнаяСтрока Из Объект.Отгрузка.Накладные Цикл
		Для Каждого ТоварСтрока Из НакладнаяСтрока.Накладная.Товары Цикл
			Если ТоварСтрока.Количество = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ТоварСтрока.Товар.Тара) Тогда
				Строка = Объект.Возвраты.Добавить();
				Строка.Контрагент = НакладнаяСтрока.Контрагент;
				Строка.Тара = ТоварСтрока.Товар.Тара;
				Строка.Отгружено = ТоварСтрока.Количество;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Таблица = Объект.Возвраты.Выгрузить();
	Таблица.Свернуть("Контрагент,Тара", "Отгружено,Возвращено");
	
	Объект.Возвраты.Загрузить(Таблица);
КонецПроцедуры
