
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
КонецПроцедуры

&НаСервере
Процедура ОборотыЗаполнитьНаСервере()
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Сальдо.Контрагент КАК Контрагент,
	|	СУММА(Сальдо.СуммаОстаток) КАК Сумма
	|ИЗ
	|	РегистрНакопления.Сальдо.Остатки(&Дата, ТипВзаиморасчета = Значение(Перечисление.ТипыВзаиморасчета.Нал)) КАК Сальдо
	|ГДЕ
	|	ИСТИНА
	|СГРУППИРОВАТЬ ПО
	|	Сальдо.Контрагент
	|УПОРЯДОЧИТЬ ПО
	|	Сальдо.Контрагент.Наименование");

	Запрос.УстановитьПараметр("Дата", Объект.Дата - 1);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаКонтрагент = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.Прямой);
	Пока ВыборкаКонтрагент.Следующий() Цикл
		СтарыеСтроки = Объект.Обороты.НайтиСтроки(Новый Структура("Контрагент", ВыборкаКонтрагент.Контрагент));
		Если СтарыеСтроки.Количество() > 0 Тогда
			ТекСтрока = СтарыеСтроки[0];
		Иначе
			ТекСтрока = Объект.Обороты.Добавить();
			ТекСтрока.Ставка = 100;
			ТекСтрока.УчетПоНалу = Истина;
		КонецЕсли;
		
		ТекСтрока.Контрагент = ВыборкаКонтрагент.Контрагент;
		ТекСтрока.Сальдо = ВыборкаКонтрагент.Сумма;
	КонецЦикла;
	
	Объект.Обороты.Сортировать("Контрагент");
КонецПроцедуры

&НаКлиенте
Процедура ОборотыЗаполнить(Кнопка)
	ОборотыЗаполнитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОборотыУдалитьПС(Кнопка)
	ПустыеСтроки = Объект.Обороты.НайтиСтроки(Новый Структура("СуммаВаловая,СуммаЧистая", 0, 0)); 
	Для Каждого Строка Из ПустыеСтроки Цикл 
		Объект.Обороты.Удалить(Строка); 
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОборотыКассаПриИзменении(Элемент)
	ТекСтрока = Элементы.Обороты.ТекущиеДанные;
	ТекСтрока.Сальдо = РаботаСКонтрагентами.Сальдо(ТекСтрока.Контрагент, ПредопределенноеЗначение("Перечисление.ТипыВзаиморасчета.Нал"), Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура ОборотыКонтрагентПриИзменении(Элемент)
	ТекСтрока = Элементы.Обороты.ТекущиеДанные;
	ТекСтрока.Сальдо = РаботаСКонтрагентами.Сальдо(ТекСтрока.Контрагент, ПредопределенноеЗначение("Перечисление.ТипыВзаиморасчета.Нал"), Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура ОборотыСуммаВаловаяПриИзменении(Элемент)
	ТекСтрока = Элементы.Обороты.ТекущиеДанные;
	ТекСтрока.СуммаЧистая = ТекСтрока.СуммаВаловая * (ТекСтрока.Ставка / 100);
КонецПроцедуры

&НаКлиенте
Процедура ОборотыСтавкаПриИзменении(Элемент)
	ТекСтрока = Элементы.Обороты.ТекущиеДанные;
	ТекСтрока.СуммаЧистая = ТекСтрока.СуммаВаловая * (ТекСтрока.Ставка / 100);
КонецПроцедуры

&НаКлиенте
Процедура ОборотыСуммаЧистаяПриИзменении(Элемент)
	ТекСтрока = Элементы.Обороты.ТекущиеДанные;
	ТекСтрока.СуммаВаловая = ТекСтрока.СуммаЧистая * (ТекСтрока.Ставка / 100);
КонецПроцедуры

&НаКлиенте
Процедура ОборотыПослеУдаления(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура ОборотыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		ТекСтрока = Элементы.Обороты.ТекущиеДанные;
		ТекСтрока.Ставка = 100;
		ТекСтрока.УчетПоНалу = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИтоги()
	СуммаВаловая = Объект.Обороты.Итог("СуммаВаловая");
	СуммаЧистая = Объект.Обороты.Итог("СуммаЧистая");
КонецПроцедуры
