
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.Касса.Записывать = Истина;
	Движение = Движения.Касса.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Касса = Отправитель;
	Движение.Статья = Справочники.СтатьиДвиженияДенежныхСредств.КассовыйПеревод;
	Движение.Примечание = глНайтиПримечания(Комментарий);
	Движение.Сумма = Сумма;
	
	Движения.Касса.Записывать = Истина;
	Движение = Движения.Касса.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Касса = Получатель;
	Движение.Статья = Справочники.СтатьиДвиженияДенежныхСредств.КассовыйПеревод;
	Движение.Примечание = глНайтиПримечания(Комментарий);
	Движение.Сумма = Сумма;
КонецПроцедуры
