
Процедура Восстановить() Экспорт
	Для Каждого ОбъектМД Из Метаданные.Справочники Цикл
		СписокПредопределенных = Метаданные.Справочники[ОбъектМД.Имя].ПолучитьИменаПредопределенных();
		
		Для Каждого Имя Из СписокПредопределенных Цикл
			Если Справочники[ОбъектМД.Имя][Имя].Пустая() Тогда
				Попытка
					НовыйЭлемент = Справочники[ОбъектМД.Имя].СоздатьЭлемент();
					НовыйЭлемент.ИмяПредопределенныхДанных = Имя;
					НовыйЭлемент.Наименование = РазбитьСтрокуНаСлова(Имя);
					НовыйЭлемент.Записать();
				Исключение
					Сообщить("Не удалось восстановить: " + Имя);
				КонецПопытки;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

Функция РазбитьСтрокуНаСлова(Исходная)
	Конечная = Лев(Исходная, 1);
	
	Для Индекс = 2 по СтрДлина(Исходная) цикл
	    Символ = Сред(Исходная, Индекс, 1);
	    Конечная = Конечная + ?(ВРег(Символ) = Символ, " " + НРег(Символ), Символ);
	КонецЦикла;
	
	Возврат Конечная;
КонецФункции
