
Процедура ПередЗаписью(Отказ)
	Филиалы.Свернуть("Филиал");
	Параметры.Свернуть("Ключ,Значение");
	
	Для Каждого Строка Из Филиалы Цикл
		Если глСсылкаСуществует(Строка.Филиал) = Ложь Тогда
			Филиалы.Удалить(Строка);
		КонецЕсли;
	КонецЦикла;
	
	ЛогиныПоВладельцу = Справочники.Логины.Выбрать(,Владелец);
	Пока ЛогиныПоВладельцу.Следующий() Цикл
		Если ЛогиныПоВладельцу.Ссылка <> Ссылка Тогда
			ЛогинОбъект = ЛогиныПоВладельцу.ПолучитьОбъект();
			
			Инд = ЛогинОбъект.Филиалы.Количество() - 1;
			Пока Инд >= 0 Цикл
				ТекущаяСтрока = ЛогинОбъект.Филиалы.Получить(Инд);
				Если Филиалы.Найти(ТекущаяСтрока.Филиал, "Филиал") <> Неопределено Тогда
					ЛогинОбъект.Филиалы.Удалить(Инд);
				КонецЕсли;
				Инд = Инд - 1;
			КонецЦикла;
			
			Если ЛогинОбъект.Модифицированность() Тогда
				ЛогинОбъект.Записать();
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
