
Процедура Сформировать(ТабДок) Экспорт
	ТабДок.Очистить();
	
	Макет = ПолучитьМакет("Основной");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьИтог = Макет.ПолучитьОбласть("Итог");
	
	ТабДок.Вывести(ОбластьШапка);
		
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Ссылка КАК Документ,
	|	Ссылка.Номер КАК НомерДокумента,
	|	Ссылка.Дата КАК ДатаДокумента,
	|	Ссылка.Склад КАК Склад,
	|	Ссылка.ВидРеализации КАК ВидРеализации,
	|	ВЫБОР КОГДА (Ссылка.Контрагент.ПолноеНаименование = """") ТОГДА (Ссылка.Контрагент.Наименование) ИНАЧЕ Ссылка.Контрагент.ПолноеНаименование КОНЕЦ КАК Контрагент,
	|	Ссылка.Контрагент.ИНН КАК ИНН,
	|	Ссылка.Договор.Номер КАК НомерДоговора,
	|	Ссылка.Договор.Дата КАК ДатаДоговора,
	|	Ссылка.Договор КАК Договор,
	|	Количество КАК Количество,
	|	Ссылка.Сумма КАК Сумма
	|ИЗ
	|	Документ.РеализацияТМЦ.Товары
	|ГДЕ
	|	Ссылка.Проведен = Истина
	|	И Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
	|	И Ссылка.Склад.НеВестиУчет = Ложь");
	
	Если НЕ Склад.Пустая() Тогда
		Запрос.Текст = Запрос.Текст + " И Ссылка.Склад В ИЕРАРХИИ (&Склад)";
	КонецЕсли;
	
	Если НЕ ВидРеализации.Пустая() Тогда
		Запрос.Текст = Запрос.Текст + " И Ссылка.ВидРеализации = &ВидРеализации";
	КонецЕсли;
	
	Если НЕ Склад.Пустая() Тогда
		Запрос.Текст = Запрос.Текст + " И Ссылка.Склад В ИЕРАРХИИ (&Склад)";
	КонецЕсли;
	
	Если НЕ ВидРеализации.Пустая() Тогда
		Запрос.Текст = Запрос.Текст + " И Ссылка.ВидРеализации = &ВидРеализации";
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + "
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаДокумента,
	|	НомерДокумента
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(Сумма)
	|ПО
	|	ОБЩИЕ,
	|	Документ";
	
	Запрос.УстановитьПараметр("Дата1", НачалоДня(Период.ДатаНачала));
	Запрос.УстановитьПараметр("Дата2", КонецДня(Период.ДатаОкончания));
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("ВидРеализации", ВидРеализации);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаИтог = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаИтог.Следующий();
	
	НомерСтроки = 1;
	ВыборкаДокумент = ВыборкаИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаДокумент.Следующий() Цикл
		ОбластьСтрока.Параметры.Заполнить(ВыборкаДокумент);
		ОбластьСтрока.Параметры.НомерСтроки = НомерСтроки;
		ТабДок.Вывести(ОбластьСтрока);
		
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	// Итог
	ОбластьИтог.Параметры.Заполнить(ВыборкаИтог);
	ОбластьИтог.Параметры.Сумма = ВыборкаИтог.Сумма;
	ТабДок.Вывести(ОбластьИтог);
	
	// Показать
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.АвтоМасштаб = Истина;
КонецПроцедуры