
//Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
//	СтандартнаяОбработка = Ложь;
//	
//	Параметры.ПолнотекстовыйПоиск = ПолнотекстовыйПоискПриВводеПоСтроке.Использовать;
//	
//	ДанныеВыбора = Новый СписокЗначений;
//	
//	Запрос = Новый Запрос("ВЫБРАТЬ
//	|	Элементы.Наименование КАК Наименование,
//	|	Элементы.ПолноеНаименование КАК ПолноеНаименование,
//	|   Элементы.Ссылка КАК Ссылка
//	|ИЗ
//	|   Справочник.Товары КАК Элементы
//	|ГДЕ
//	|   Элементы.Код ПОДОБНО &СтрокаПоиска
//	|   ИЛИ Элементы.Наименование ПОДОБНО &СтрокаПоиска
//	|	ИЛИ Элементы.ПолноеНаименование ПОДОБНО &СтрокаПоиска
//	|	ИЛИ Элементы.Наименование ПОДОБНО &СтрокаПоискаТранслит
//	|	ИЛИ Элементы.ПолноеНаименование ПОДОБНО &СтрокаПоискаТранслит");
//	
//	Запрос.УстановитьПараметр("СтрокаПоиска", "%" + Параметры.СтрокаПоиска + "%");
//	Запрос.УстановитьПараметр("СтрокаПоискаТранслит", "%" + СтроковыеФункции.Транслитерация(Параметры.СтрокаПоиска) + "%");
//	
//	Выборка = Запрос.Выполнить().Выбрать();
//	
//	Пока Выборка.Следующий() Цикл
//	    ДанныеВыбора.Добавить(Выборка.Ссылка, ?(ЗначениеЗаполнено(Выборка.ПолноеНаименование), Выборка.ПолноеНаименование, Выборка.Наименование));
//	КонецЦикла;
//КонецПроцедуры