
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПроверитьДокумент(ПараметрКоманды);
	
	Подписать = (Вопрос("Хотите сразу подписать документ?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да);
	
	Попытка
		МодульЭДО.ОтправитьДокумент(ПараметрКоманды, Подписать);
	Исключение
		ВызватьИсключение;
	КонецПопытки;
	
	ИмяОператора = СокрЛП(ОбщийМодульСервер.ПолучитьЗначениеКонстанты("ЭДО_ОсновнойОператор"));

	Если Подписать Тогда
		Предупреждение("Документ успешно отправлен и подписан через систему '" + ИмяОператора + "'.");
	Иначе
		Предупреждение("Документ успешно отправлен через систему '" + ИмяОператора + "'.");
	КонецЕсли;
КонецПроцедуры

Процедура ПроверитьДокумент(Документ) Экспорт
	ИмяОператора = СокрЛП(Константы.ЭДО_ОсновнойОператор.Получить());
	
	//Если ЗначениеЗаполнено(Документ.Источник) Тогда
	//	ВызватьИсключение "Невозможно отправить этот документ на ЭДО, так как, он был загружен из другого источника.";
	//КонецЕсли;
	
	Если Документ.Проведен = Ложь Тогда
		ВызватьИсключение "Непроведенный документ нельзя отправлять на ЭДО.";
	КонецЕсли;
	
	Если Документ.ВидРеализации.ТипВзаиморасчета <> Перечисления.ТипыВзаиморасчета.Безнал Тогда
		ВызватьИсключение "Нельзя отправлять документов с таким видом реализации на ЭДО.";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Документ.Контрагент.ИНН) = Ложь И ЗначениеЗаполнено(Документ.Контрагент.ПИНФЛ) = Ложь Тогда
		ВызватьИсключение "У контрагента не указан ИНН/ПИНФЛ.";
	КонецЕсли;
	
	Если Документ.Контрагент.ПлательщикНДС Тогда
		Если ЗначениеЗаполнено(Документ.Контрагент.КодПНДС) = Ложь Тогда
			ВызватьИсключение "У контрагента не указан регистрационный код плательщика НДС.";
		КонецЕсли;
	КонецЕсли;
	
	ДокументЭДО = ЭлектронныеДокументы.Получить(Документ);
	
	Если ЗначениеЗаполнено(ДокументЭДО) Тогда
		Если ДокументЭДО.Статус <> Перечисления.СтатусыЭДО.Черновик Тогда
			ВызватьИсключение ИмяОператора + ": Документ уже отправлен и подписан через систему '" + СокрЛП(ДокументЭДО.Оператор) + "'.";
		Иначе
			ВызватьИсключение ИмяОператора + ": Документ уже отправлен через систему '" + СокрЛП(ДокументЭДО.Оператор) + "'.";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
