
Процедура Обновить(Сертификаты) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	Список = Новый Массив;
	
	Для Каждого Сертификат Из Сертификаты Цикл
		ВыборкаСсылка = Справочники.Сертификаты.НайтиПоКоду(Сертификат.Код,,, ПараметрыСеанса.Пользователь);
		
		Если ВыборкаСсылка.Пустая() Тогда
			ВыборкаОбъект = Справочники.Сертификаты.СоздатьЭлемент();
        Иначе
			ВыборкаОбъект = ВыборкаСсылка.ПолучитьОбъект();
		КонецЕсли;
		
		ВыборкаОбъект.Код = Сертификат.Код;
		ВыборкаОбъект.Наименование = Сертификат.Наименование;
		ВыборкаОбъект.Владелец = ПараметрыСеанса.Пользователь;
		ВыборкаОбъект.Организация = Сертификат.Организация;
		ВыборкаОбъект.Срок = Сертификат.Срок;
		ВыборкаОбъект.ИНН = Сертификат.ИНН;
		ВыборкаОбъект.ПИНФЛ = Сертификат.ПИНФЛ;
		ВыборкаОбъект.Диск = Сертификат.Диск;
		ВыборкаОбъект.Путь = Сертификат.Путь;
		ВыборкаОбъект.Имя = Сертификат.Имя;
		ВыборкаОбъект.Псевдоним = Сертификат.Псевдоним;
		ВыборкаОбъект.Тип = Сертификат.Тип;
		ВыборкаОбъект.Записать();
		
		Список.Добавить(ВыборкаОбъект.Ссылка);
	КонецЦикла;
	
	Выборка = Справочники.Сертификаты.Выбрать(,ПараметрыСеанса.Пользователь);
	Пока Выборка.Следующий() Цикл
        Если Список.Найти(Выборка.Ссылка) = Неопределено Тогда
			ВыборкаОбъект = Выборка.ПолучитьОбъект();
			ВыборкаОбъект.Удалить();
		КонецЕсли;
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры